[
  {
    "date": { "date": "August 28", "time": "12:44 PM" },
    "content": "Boy do I have a story to tell.  You know how I was keeping track of Michael’s safe combo?  Well it finally came in handy.  I was trolling around the office last night after hours and heard some noise coming from the boss’s room.  Normally the office is real quiet at night, which is why I stick around in the first place.  Quiet is like a drug to me and if I don’t get my fix every night, I start to get the shakes.  \n\nSo anyway, I heard these noises and got freaked out that the bossman was using his office for a little nighttime nooky with that new chick that sits in Tony’s seat every day.  Not wanting to get caught, I dropped down and started to army crawl over to investigate (I got a Private Investigator license so I’m allowed to investigate anything I want, suckers).  As luck would have it, there wasn’t anybody in there.  Turns out that the noise was coming from inside Michael’s big furniture cabinet thing.  So I opened the cabinet door, half expecting a cat to jump out at me.  Usually when I open cabinets or closets or anything, cats end up pouncing on me.  For some reason, cats find me very attractive.\n\nNothing jumped out at me, but I could hear the rustling pretty close to the ground, so I bent over and figured out that it was coming from the safe.  For a second, I just stared at it, wondering what could be inside.  Then I realized that I had been saving up Michael’s safe combo for this very occasion.  Well, this occasion and whenever I needed some cash, but that’s beside the point.  \n\nI went over to my computer and looked back at my previous entries of this thing.  Apparently I wasn’t too good with my record keeping because the numbers were kind of off.  I ended up trying out every combo I wrote down and you know what?  I didn’t get it right until the very last one I tried.  The good news is, I got it open and you’ll never guess what was inside.\n\nNo, it wasn’t a cat, smart ass.  It was a squirrel!  I don’t know for the life of me why that guy had a squirrel in his safe, but I do know that I got me a new pet.  And I’m going to train it.  Right now I’m calling it Butthead, but I’m open to suggestions for new names if you got any.  In just a few months, I’m going to have the best trained squirrel in Pennsylvania.  I’m also going to blackmail Michael because I’m pretty sure it’s against the law to lock a squirrel in a safe.  False imprisonment or something.\n\nEverything’s coming up Creed!"
  },
  {
    "date": { "date": "August 21", "time": "09:39 AM" },
    "content": "I want to say I was about four years old when I fell in love with music.  My memory’s not great, so it could have been anywhere between four and fourteen, but I think it was closer to four.  I was hanging out in an old abandoned car factory in South Carolina and I came across a bunch of old bumpers lying on the ground.  At that age, I used to walk around with a bunch of sticks in my back pocket in case I ever needed something to throw.  When I saw those bumpers, I don’t know what came over me, but I knew that I had to take out a pair of sticks and start banging away.\n\nFrom the instant my sticks hit that metal, I was hooked.  I pounded out beat after beat, dancing and singing along.  I loved it.  The music jumped into my body like a venereal disease from a hooker.  I stayed in that factory for hours and hours just banging away.  The next day, I came back and started right up where I left off.  I made up songs about everything: jump ropes, corn, beaver skin hats.  Nothing was off limits.\n\nAbout a week later, I saw an old man playing a beat-up guitar on the street.  I watched him for a while, trying to learn what he was doing as I stood there.  After about an hour, he said he had to go to the can and asked me to watch his instrument.  I gladly agreed.  When he left to go to the bathroom, I snatched the guitar and ran all the way to the factory.  It was the first thing I had ever stolen and on that day, I said to myself “Music and thieving are going to be the biggest things in your life” and you know what?  They still are.\n\nMusic has been a part of me ever since.  Not a day goes by where I don’t tap out a rhythm or pick up my axe and play a lick or two.  If you cut open my veins, I’m fairly certain that quarter notes would come tumbling out.  I can’t imagine my life without music and I don’t want to.  "
  },
  {
    "date": { "date": "August 14", "time": "09:23 AM" },
    "content": "I spend a lot of time in the library.  Don’t get me wrong; I’m not there for the books.  Books are for table balancing and throwing at birds.  I go for the air conditioning and the smell.  Libraries smell good.  It almost makes me want to like books, but not quite.  Anyway, there’re a lot of kids at the library -- maybe it’s summer school or something – and these kids talk like I’ve never heard before.  It’s like a secret street language and I want in.  They say stuff like “that dude got clowned” and “he got that swag when he walks.” I want to know what the hell these kids are talking about, but they won’t tell me.  I’ve tried going up to the kids to talk about the phrases, but they get kind of freaked out by me.  Just wait until they need an ID – then we’ll see who’s running away and telling the librarians.\n\nAnyway, those jerks won’t tell me anything, so I’m making up my own words and phrases.  This is my street dictionary and I’m not even charging for it.  Just don’t tell the kids in the library, okay?\n\nKeep it bowlin’ – Everyone likes bowling, so this is a phrase for when you want to tell someone to stay positive.  For example, if someone tells you they lost their job, you can just tell them to keep it bowlin’ and that’ll cheer them up.\n\nPloppers – This means bad.  “Did you see that movie last night?  It was ploppers.”\n\nHorribly obese – I’m taking this one from the library kids.  They say things are fat all the time, so I took it a step further.  In this case, it means the most beautiful ever.  If a foxy dame comes walking in, you can call her horribly obese.  I think it might take some time before it catches on, so use this one with caution because some broads may not have heard it yet and could take it the wrong way.\n\nWilly fingers – Perhaps the hardest to explain, but you get willy fingers when you really want to fight someone.  “When my boss was yelling at me, I really started getting willy fingers.”  Your fingers start moving real fast and itching because they want to hit something – that’s the willy fingers.\n\nThose kids are going to regret not letting me in on their lingo.  My slang’s going to take over the nation and there’s nothing those idiots can do to stop it.  Keep it bowlin’, people."
  },
  {
    "date": { "date": "August 07", "time": "09:33 AM" },
    "content": "We’re having a party at work tomorrow to celebrate “08/08/08 Day,” which is great because I’ll be able to eat enough that I won’t have to buy food for a week.  That’s my favorite part about work parties – they end up saving me a lot of moolah in the long run.  I wish they were more fun, though.  If I was in charge, we’d be rocking and rolling all night.  My parties would go down in history as the best work parties of all time.  Here’s a rundown of my perfect party:\n\nWe’d start out with a bang, and by that I mean I’d fire off a starter’s pistol so people knew the party actually started.  The very first event of the party would be Bobbing for Creed Shots.  I’d fill a large kiddie pool with Creed Juice -- a mixture of kool-aid, Pop Rocks, and grain alcohol -- and throw some shot glasses in there.  Then everyone has to lean in, grab a shot glass with their mouths, and take the shot.  It’s messy but it sure gets things started right.  If you’re not drunk after Bobbing for Creed Shots, you’re not playing right.\n\nSo after everyone’s good and sauced up, I’d break out the piñatas.  The key to piñatas at parties is naming them.  If you name them after co-workers, you know people are going to really get into it.  I’m not so great with names, so I’d let somebody else do the naming, but trust me, they would all be named.  As for filling them, that all depends on the budget.  If there’s no dinero for the piñatas, then I’d fill them with dry rice.  If there’s a little cash around, then I’d go for hard candy.  With hard candy, you get the fun of seeing the piñata burst AND the injuries that go with it.\n\nAfter piñata time, we’d go straight into the eating contests.  I’m partial to deviled eggs for quantity, but I know hot dogs are pretty popular these days, too.  I’d compromise and make hot dog omelets for everyone to scarf down.  I’m pretty sure I know who’d win, but you never can tell – sometimes the smallest accountants make the biggest eaters.\n\nWhen the party winds down, I’d do another round of Bobbing for Creed Shots and then send people on their way with Goody Bags.  The bags would just be filled with office supplies, but hey, everyone likes a parting gift, right?\n\nThey should really make me head of that party committee thing.  I’d be amazing."
  },
  {
    "date": { "date": "July 31", "time": "09:24 AM" },
    "content": "Why is it so impressive to sleep on a bed of nails?  There’s obviously a trick to it that makes it not hurt.  I think the real challenge is sleeping in a bed filled with needles.  You just know that’s not gonna end well.\n\nI’ve gone for rolls in the hay and it is nothing like sex.\n\nSometimes I’ll do shots of mouthwash.  It gets me a little tipsy and gives me great breath.\n\nI think baseball should introduce a longstop position, just in case the shortstop misses the ball.\n\nWho decided that we needed both North and South Dakota.  It seems like a lot of wasted paperwork to me.\n\nCatching flies with your hands is fun, but catching frogs with your feet is a lot more satisfying.\n\nI like to wear two undershirts most days because you never know when you’ll walk into a strip poker game. \n\nI want to open up a bar called “Creed’s Meads” and bring mead back to how popular it was during the American Revolution.  It’ll be right between my book store and woodwind instrument shop – Creed’s Reads and Creed’s Reeds.\n\nWhy hasn’t anyone built a live-action version of Chutes and Ladders?  I’d be first in line to play.\n\nI’ve always thought that shopping carts are just mobile jails for food and all the prisoners are sentenced to death by ingestion.  Kind of makes you shop differently, huh?"
  },
  {
    "date": { "date": "July 24", "time": "09:33 AM" },
    "content": "I’m Batman.  At least that’s what I tell women in bars after a few rounds.  It’s a great pick-up line because they have no way of knowing if it’s true or not.  Sure, they have a 99% chance of knowing that you’re not Batman, but it’s that 1% that gives you the in.\n\nWhat you’re really looking for is the lady that wants to argue with you about how much you’re not Batman.  Those are the broads that end up in bed with you later on yelling “Yes, Batman!  Show me your utility belt!”  It works every time.  It also helps to have a utility belt with you because up until that point, she may still not believe you’re Batman, but when you produce the utility belt, you send her head spinning.\n\nI never used to be good at pick-up lines because I was too direct.  “I’d like to be your blanket” works on some chicks, but most of them just slap you and walk away.  Don’t get me wrong, I love a good slapping.  It’s good for the skin and makes you focus on the task at hand.  I’d just rather talk to the woman than get slapped, that’s all.  So I had to take a different approach.  I’ve heard of new dating advice books where you’re supposed to insult a girl to get her attention, but I think that’s the wrong approach.  If I’m not pretending to be Batman, I like to use really impressive facts to get them to talk to me.\n\nI’ll pick out the hottest lady in the bar (or zoo or botanical garden or wherever else I might happen to be) and get her attention with a really loud whisper.  Women respond really well to whispers.  It’s because they like secrets.  So I’ll whisper, “Hey you, come over here” and I’ll look like I’ve got a real big secret to tell them.  When they come over, I reach into my bag of facts (not literally) and pull out a good one.  “Dolphins are the only animals besides humans that copulate for pleasure.”  It works like a charm.  Most of the time.  Not really.  It gets me slapped less, though, so I’m sticking with it."
  },
  {
    "date": { "date": "July 17", "time": "12:38 PM" },
    "content": "I’ve been trying something new lately and it’s really put a new spin on how I go through my days.  Instead of waking up ten minutes before work and wiping myself down with a damp paper towel, I’ve been waking up really early and going for walks all over town.  You’d be amazed at how quiet this place is without people in it.  I haven’t felt this peaceful in years.\nI went over to Nay Aug Park the other day at around 4am and even the geese were still asleep when I got there.  I couldn’t believe my luck.  It’s been a dream of mine for years to see how far I could throw a goose and this was the perfect opportunity.  I’ve definitely learned that you’ve got to strike fast when dealing with sleeping animals because the element of surprise is your biggest weapon.  That old wives’ tale about letting sleeping dogs lie only applies if you don’t have a plan for after you wake up the dog.  With geese, it’s the same story.  You wake up a goose just for the fun of it, you’ll get pecked like no tomorrow.  Their beaks are painful, man.  You don’t want to find out first hand.\n\nI’ve been trying something new lately and it’s really put a new spin on how I go through my days.  Instead of waking up ten minutes before work and wiping myself down with a damp paper towel, I’ve been waking up really early and going for walks all over town.  You’d be amazed at how quiet this place is without people in it.  I haven’t felt this peaceful in years.\n\nI went over to Nay Aug Park the other day at around 4am and even the geese were still asleep when I got there.  I couldn’t believe my luck.  It’s been a dream of mine for years to see how far I could throw a goose and this was the perfect opportunity.  I’ve definitely learned that you’ve got to strike fast when dealing with sleeping animals because the element of surprise is your biggest weapon.  That old wives’ tale about letting sleeping dogs lie only applies if you don’t have a plan for after you wake up the dog.  With geese, it’s the same story.  You wake up a goose just for the fun of it, you’ll get pecked like no tomorrow.  Their beaks are painful, man.  You don’t want to find out first hand.\n\nWhen I saw those geese getting some shuteye, I knew exactly what to do.  I picked out one that looked like it might be lighter than some of the other ones.  [Side note: Can we stop feeding the geese so many damn breadcrumbs?  They’re plenty fat as it is.]  I decided to name it “Tosserton,” because it seemed appropriate at the time and I find that I can throw things farther if they have a name.  When I was sure that Tosserton was definitely asleep and not faking it, I picked out my landing zone and went in for the throw.\nGoose tossing is a hard art to master and with no means to practice, I had to rely on what it looked like in my dreams.  So I got a running start, went full steam ahead, picked up Tosserton and threw him (her?) hammer-toss style as far as I could, spinning my body to get maximum torque.  I was pretty freaked out about how flexible her (his?) neck was, but it ended up helping me get more distance than I would have otherwise.  I’d say I got a good forty feet, which is shorter than I predicted, but still a pretty admirable toss in my opinion.\nYou should have heard Tosserton honking in the air.  He (she?) righted herself (himself?) right before hitting the ground and ended up just gliding to safety, so I didn’t have to feel bad about hurting Tosserton.  After the goose landing, I was overcome with an enormous sense of completion.  It was one of the greatest experiences of my life.\nI will say this:  I don’t recommend goose-tossing to anyone unless you’ve had a steady series of dreams over the last twenty years about it.  If you don’t have the instincts bred into you subconsciously, then you won’t be ready to do it.  Leave the goose-tossing to the professionals, people.  Don’t try it at home.\n\nWhen I saw those geese getting some shuteye, I knew exactly what to do.  I picked out one that looked like it might be lighter than some of the other ones.  [Side note: Can we stop feeding the geese so many damn breadcrumbs?  They’re plenty fat as it is.]  I decided to name it “Tosserton,” because it seemed appropriate at the time and I find that I can throw things farther if they have a name.  When I was sure that Tosserton was definitely asleep and not faking it, I picked out my landing zone and went in for the throw.\n\nGoose tossing is a hard art to master and with no means to practice, I had to rely on what it looked like in my dreams.  So I got a running start, went full steam ahead, picked up Tosserton and threw him (her?) hammer-toss style as far as I could, spinning my body to get maximum torque.  I was pretty freaked out about how flexible her (his?) neck was, but it ended up helping me get more distance than I would have otherwise.  I’d say I got a good forty feet, which is shorter than I predicted, but still a pretty admirable toss in my opinion.\n\nYou should have heard Tosserton honking in the air.  He (she?) righted herself (himself?) right before hitting the ground and ended up just gliding to safety, so I didn’t have to feel bad about hurting Tosserton.  After the goose landing, I was overcome with an enormous sense of completion.  It was one of the greatest experiences of my life.\n\nI will say this:  I don’t recommend goose-tossing to anyone unless you’ve had a steady series of dreams over the last twenty years about it.  If you don’t have the instincts bred into you subconsciously, then you won’t be ready to do it.  Leave the goose-tossing to the professionals, people.  Don’t try it at home."
  },
  {
    "date": { "date": "July 10", "time": "09:24 AM" },
    "content": "One of my great joys in life is going to the car wash.  Some people may think of it as a hassle, just another chore in their already over-chored lives, but not me.  The car wash for me is a wonderful place.  It’s where you go to get a new lease on life, or at least a new lease on your scooter.  I’m not talking about actual leases – I have no idea how to get a new lease on a scooter.  I won mine in a fight.  I’m talking about that feeling when you bring in your scooter all caked in mud and whatever other junk might be stuck on there and you ride off with a shiny new-looking scooterino.  That’s satisfaction. \n\nYou might not have a scooter.  You might have a car: the more “traditional” vehicle to take to a car wash.  I’m a proud scooter owner and as a proud scooter owner, I like to keep my scooter clean.  After all, dirt really shows up on red plastic, you know?  So once every month or so in the summer, I take a trip to the place on Moosic and get my wheels all soaped up.\n\nIt’s hard to describe the feeling I get at the car wash without sounding dirty (not that that’s ever stopped me before), but I’ll try.  It feels a little bit like I’m in the hospital getting a sponge bath from some real foxy nurses.  Replace hospital with car wash and real foxy nurses with real burly joes and that’s pretty much what the experience is like.  I love to see them get down and dirty with my little scooter.  Wipe it down and rinse it off and put so much care into the job.  When it comes out of there all gleaming and clean, I feel like I need a smoke.\n\nLook, I’m not a real extravagant guy.  I pick fights with extravagant guys.  But the car wash is the one place where I can throw down eight bucks once a month and feel like a king.  A fella’s got to feel pampered once in a while, you know?"
  },
  {
    "date": { "date": "July 03", "time": "09:05 AM" },
    "content": "The 4th of July is tomorrow and some would say it’s the greatest American holiday.  Not me.  I think America Day beats the pants off of the 4th of July.\nYou may have missed America Day this year because it’s not really well-advertised.  It takes place on June 20th and it is a sight to behold.  America Day was created by a friend of mine named Samuel Che Emanuel.  He’s rail-thin with a haircut that looks oddly as if a woman had her hair cut short like a man.  It’s hard to describe, but it’s a feminine masculine haircut, if that makes sense to anyone.  He’s a real sparkplug of a guy.  Grew up in the wilderness of Colorado with a pet bear.  It was a midget bear, so he didn’t have to worry about it eating him or anything.  His parents were trappers and lived “off the grid” so to speak, so wildlife pets were nothing new to him.\nAnyway, one day, Sammy Che (as we call him) was walking with Midgy (as he called his bear) and stumbled upon a rock formation that looked like an eagle soaring through the air with a flag waving behind it.  I’m guessing that Sammy Che was tripping pretty hard that day, so who knows what the rock formation actually looked like.  All we know is that Sammy Che returned home and declared that day America Day.  When I first met Sammy Che, it was the 20th anniversary of America Day and he showed me how the day is properly celebrated.\n\nThe 4th of July is tomorrow and some would say it’s the greatest American holiday.  Not me.  I think America Day beats the pants off of the 4th of July.\n\nYou may have missed America Day this year because it’s not really well-advertised.  It takes place on June 20th and it is a sight to behold.  America Day was created by a friend of mine named Samuel Che Emanuel.  He’s rail-thin with a haircut that looks oddly as if a woman had her hair cut short like a man.  It’s hard to describe, but it’s a feminine masculine haircut, if that makes sense to anyone.  He’s a real sparkplug of a guy.  Grew up in the wilderness of Colorado with a pet bear.  It was a midget bear, so he didn’t have to worry about it eating him or anything.  His parents were trappers and lived “off the grid” so to speak, so wildlife pets were nothing new to him.\n\nAnyway, one day, Sammy Che (as we call him) was walking with Midgy (as he called his bear) and stumbled upon a rock formation that looked like an eagle soaring through the air with a flag waving behind it.  I’m guessing that Sammy Che was tripping pretty hard that day, so who knows what the rock formation actually looked like.  All we know is that Sammy Che returned home and declared that day America Day.  When I first met Sammy Che, it was the 20th anniversary of America Day and he showed me how the day is properly celebrated.\n\nFirst, you wake up and immediately eat an apple.  Why an apple?  Because there’s nothing more American than an apple.  The next step in a successful America Day is selecting the right costume.    For the past five years, I’ve opted to dress as Henry Clay, one of the best greatest senators in American history.  The costume is up to you, though.  It should be somehow related to America’s greatness, but doesn’t have to be a person.  I’ve seen Constitutions, watermelon, and a costume that illustrated America’s immigration policy from 1885-1921.  \nOnce you’re in costume, it’s time to participate in the traditional parade entitled “America the Beautiful,” where everyone parades around in their costumes and throws hard candy at each other.  The parade is my favorite part of America Day.\nAfter the parade, everyone goes to the liquor store, buys a bunch of beer and drinks until they can’t say “Democracy.”  It’s truly the greatest holiday we have.  Next June 20th, everyone should give it a shot.  \nAmerica!  Living the dream!\n\nFirst, you wake up and immediately eat an apple.  Why an apple?  Because there’s nothing more American than an apple.  The next step in a successful America Day is selecting the right costume.    For the past five years, I’ve opted to dress as Henry Clay, one of the best greatest senators in American history.  The costume is up to you, though.  It should be somehow related to America’s greatness, but doesn’t have to be a person.  I’ve seen Constitutions, watermelon, and a costume that illustrated America’s immigration policy from 1885-1921.  \n\nOnce you’re in costume, it’s time to participate in the traditional parade entitled “America the Beautiful,” where everyone parades around in their costumes and throws hard candy at each other.  The parade is my favorite part of America Day.\n\nAfter the parade, everyone goes to the liquor store, buys a bunch of beer and drinks until they can’t say “Democracy.”  It’s truly the greatest holiday we have.  Next June 20th, everyone should give it a shot.  \n\nAmerica!  Living the dream!"
  },
  {
    "date": { "date": "June 26", "time": "09:29 AM" },
    "content": "I’ve always liked uniforms.  When I was a kid, I wore sailor suits every day until I was eight.  People called me Captain Crapstick because of how I dressed and the fact that I would carry around a stick with me that I used for poking all sorts of crap.  I still have my sailor suit hanging proudly in my closet, but I only break it out when a special lady comes over.  It doesn’t fit so well anymore, but I still look darn cute in it.\n\nIn my opinion, every job should have a uniform.  Fast-food workers, gas station attendants, exterminators, these guys all have it covered already.  I’m pushing for the jobs that make you waste time every morning decided what to wear.  Take my job, for instance.  I know I’m not allowed to wear shorts, because every time I do, I get yelled at.  I also can’t wear vests without shirts underneath.  So I’m locked into wearing a certain combination of clothing every day, but there are just too many choices.  If it were up to me, I’d implement an office worker uniform so you could just wake up every morning, go to your uniform closet, and three seconds later you’re all set.\n\nMy uniform would consist of three items and three items only.  \n\n1. Navy blue sweatpants.  These are the first item because they’re the most important.  When I go home, the first thing I do is put on navy blue sweatpants.  You can’t find a more comfortable piece of clothing.  The color is great because you can spill all you want and nobody’s the wiser.  All in all, if the uniform doesn’t include navy blue sweatpants, I don’t want the job. \n\n2. A vest.  No shirt required.  Vests are amazing inventions.  They cover up your nipples (which society has decided are unacceptable to see, for some reason) and they’re classy.  You want to class up a joint?  Throw on a vest.  You want to add some more class?  Make sure that vest is leather.\n\n3. Comfy slippers.  Right after I change into my navy blue sweatpants, I slide on my sheepskin-lined slippers.  Talk about comfort!  These little puppies make it feel like you’re walking on a field of soft paralyzed sheep – I say paralyzed only so you don’t picture the sheep as moving.  If I could wear slippers to work every day, I’d probably start caring about my job.\n\nThese three items could change the workplace as we know it.  I’m serious, America.  Just think about how much more productive we would be as a country if all office-workers wore navy blue sweatpants, vests without shirts, and comfy slippers.  We’d be a comfortably dressed productivity superpower, and honestly, isn’t that what all this fighting is about anyway?"
  },
  {
    "date": { "date": "June 19", "time": "09:22 AM" },
    "content": "I don’t know about you, but I’m known far and wide as a guy that can cut a rug.  Not literally.  I’ve never actually sliced into any rugs, but I bet I’d be pretty good at that, too, considering how handy I am with knives.  \n\nI can cut a rug in the sense that I can dance like a mofo.  Ever since I was little, I’ve had rhythm in me.  Everyone used to call me Lil’ Josephine Baker because I liked to shake it everywhere I went, plus I once made a skirt out of bananas.  My favorite place to hoof it was the market.  One time, I was dancing up a storm in the produce section and I knocked into a huge display of apples.  Those Red Delicious came tumbling down, but that didn’t stop little Creedy.  No sir.  I just kept on twirling and juking and the apples became my dance floor.  When I was finished, the whole store applauded, except for the manager, who called the police.\n\nNot to toot my own horn or anything, especially because my horn is pretty dusty and might make everyone sick if I tooted it, but I’m pretty sure I invented break dancing.  I used to have my neighbor bang out a beat on his kick drum while I tried to spin around on my back.  At the time, I did it to get dizzy.  In retrospect, it’s pretty clear to me that I was inventing a new style of dance.\n\nI’ve got a pair of dancing shoes that are made out of magic.  They’ve got a black and white checker pattern on them and I bought them from a Serbian flutist who needed some cash to get his flute out of hock.  From the minute I put them on, I felt like my feet had a mind of their own.  They just tap-tap-tap to their own beat and I do my best to keep up.  For a while, I thought the guy put Mexican jumping beans in the heels, but I checked and there aren’t any beans in those shoes.  Not unless I decide to put them there and, as of right now, I have no interest in doing so. \n\nThe only place I won’t dance for fun is on people’s graves.  I dance on people’s graves for disrespect purposes only and nothing more."
  },
  {
    "date": { "date": "June 12", "time": "09:23 AM" },
    "content": "When something’s both good and bad, people say it’s “a double-edged sword.”  I think that’s ridiculous.  A double-edged sword is always a good thing.  You can do twice the damage with it.\n\nI believe the children are our future.  Specifically Chinese children.\n\nGambling for money is fun, but gambling for livestock is so much better.  If you end up winning, you get the satisfaction of victory and a ride home.\n\nI like to tell time using the sun.  If it’s sunny, then it’s time for work.  If it’s dark, then it’s time to make money.\n\nGlobes are great for hiding stuff.  Nobody ever bothers to look inside a globe, and if they do, they’re probably really weak anyway, so you can just beat them up and run away.\n\nNever talk to men with red hair.  They live by different rules than you or I.  There’s a reason all the famous clowns have red hair and it’s not because red is a friendly hair color.\n\nI’ve been running a lot lately and I’m getting into really good shape.  Of course, it really helps that I’m carrying a lot of loot while I run.\n\nWhen I’m in a new situation, I tell everyone it’s my birthday.  People really treat you better when they think it’s your birthday, whether they know you or not.\n\nI hate waiting.  It drives me nutso.  If I’m at a drive-thru window and it’s taking too long to get my food, I’ll just get out of my car and go for a walk for half an hour.  When I get back, I’m much calmer and the fast food joint gets an important message about wasting people’s time.\n\nI carry a salt shaker in my pocket because you never know when you’ll need to teach a slug a lesson.\n\n\nReminder: Michael’s safe combo: 86-7-53-09"
  },
  {
    "date": { "date": "June 05", "time": "09:17 AM" },
    "content": "Let’s talk about gas, because at this moment in history, it’s out of control.  Seriously.  I’ve had bad gas for weeks now and I don’t know what to do about it.  It’s terrible and I mean really awful.  It smells a little like a mix between very wet cats and regurgitated corn chips.  I don’t know what’s been causing it, but I need to find out because it’s making me sick.\n\nHonestly, if I didn’t have to smell it myself, I’d be happy about it.  Gas is a powerful weapon.  You want some space to yourself?  Unload a popper and those seats next to you clear out real fast.  You want a day off of work?  Start a little seat orchestra and you’ll be sent home in no time.  I wish I were back in my twenties when I couldn’t smell anything because then I’d have some fun with these stinkbombs.  Sadly, every time I let one go, I’m my own first victim.\n\nI end up being victim to myself a lot.  That’s what happens when you do a lot of home chemical mixing.  It started out as a hobby, but I’ve really stepped up my game in the last few years.  I’m trying to find a chemical cure for wrinkles, but it’s not going so well.  I have, however, invented quite a few potions for giving yourself rashes.  When rashes come back into “vogue,” I’ll be the king of the rash world.\n\nRash World sounds like a really fun theme park, don’t you think?  I’d visit, as long as the admission price wasn’t too high.  I wonder if they have funnel cakes at Rash World.  Funnel cakes are incredible.  They’re my favorite fried batter-based cake.\n\nOther types of cakes that I enjoy: snack cakes, birthday cakes, coffee cakes, tea cakes, ice cream cakes, urinal cakes, erotic cakes, layer cakes, hot cakes, and wedding cakes.  Cakes that I do not enjoy: cupcakes.  Why waste my time on a cupcake when I can get the real deal?  Cupcakes should only be eaten in times of war or famine.  Or when they’re filled with cream.  That’s it."
  },
  {
    "date": { "date": "May 29", "time": "09:35 AM" },
    "content": "Short broads.  They’re the best.  If you’ve been keeping up with these bloggeroos, you might remember the types of women I go for: Brazilian, Ukrainian, South African, Canadian [the further North, the better], short, and Wisconsin.  I didn’t say that the list was in order, though.  Truth be told, short is at the way top of the list, while Ukrainian is actually really far down.  That being said, if I found a short Ukrainian dame, I wouldn’t kick her out of my sleeping bag (for some reason, I can’t find my bed again – if you’ve seen it, give me a call).  For me, short is where it’s at and this little entry is a tribute to short girls everywhere.  I wrote them a poem.\n\n\nShort Girl\nBy Creed Bratton\n\nOoh, mama, with your tiny little legs\nYou’re like a dachsund\nIn human form\nAnd that makes you okay\nIn my book\n\nI want to throw you up into the air\nLike a ball of shortness\nAnd catch you when you fall down\nAnd put you into my jacket pocket\nThat I have lined with pillows and string cheese\n\nYeah, mama, you’re small and nice\nIn those little lady clothes\nThat you wear so well\nYou could be a minus-sized fashion model\nAnd that’s the truth\n\nShort girl\nYou make my day"
  },
  {
    "date": { "date": "May 22", "time": "09:25 AM" },
    "content": "Back in the fall, I was drinking a lot of Red Bulls and they really made me feel like I was being shot out of a cannon.  I loved the stuff.  Problem is, that junk is expensive.  Who can afford to drink more than one a day?  Certainly not me.  My money goes to more enterprising pursuits, like laminating equipment and buying ladies drinks.  I wish I could drink six or seven cans of the stuff a day to keep me going, but until I win the lottery, that’s not happening.  When I was in the convenience store the other day, though, I saw this new energy drink called VivaMaxxPlus, so I decided to give it a shot.\n\nLet me tell you, that stuff is amazing.  They’re half the price of the Bull and they get my heart going even faster.  It’s incredible.  I drink a whole mess of them at lunchtime and then I’m awake until the sun comes up.  It really helps me get through the workday and then my real workday, which starts at around 10pm.  It’s hard to explain the feeling I get, but it’s like someone hooked up a battery to my body and it’s in charge of making my blood flow, but the dial that controls the speed got messed up and it’s stuck on “super fast.”  That’s exactly what it feels like.  That, or stepping on an exposed wire at a construction site where you’re trying to scam some copper late at night.  I know what that feels like and VivaMaxxPlus is pretty similar.  \n\nI decided I have to limit myself to three or four a day or else I’m going to get in some real trouble.  Any more than that and I get pretty aggressive.  Last week, I drank five cans of the sauce and when this new lady started questioning me about what I did at work, I freaked out.  I started imagining me and her on a go-kart track, but she didn’t have a go-kart and my go-kart had all kinds of James Bond spy weapons on it.  Right when I started picturing myself shooting her with my dashboard missiles, I realized I needed to take it down a notch.  I’m not a violent person, but there’s something in that VivaMaxxPlus that makes me craaaaaaazy.\n\nI wonder if they sell a decaf version…"
  },
  {
    "date": { "date": "May 15", "time": "09:30 AM" },
    "content": "Between the ages of 18 and 31, I completely lost my sense of smell.  I was using this nose spray that was supposed to make me a better lover and after about a week of using the stuff, I couldn’t smell a damn thing.  It might have been all of the ground-up tiger particles that were supposed to really jump-start your manhood, but who knows?  Anyway, I didn’t get my sniffer back until a few days after my 31st birthday when I was walking past this Ukrainian deli and thought to myself “Am I smelling kovbasa?”  Indeed I was.  I launched into that sausage like there was no tomorrow because it was the first thing I could really taste in years.  Ever since then, I’ve been really aware of how important smell is to me.  \n\nThat’s why I’m proud to announce the arrival of my new fragrance, “CreedScents.”  It’s a mixture of my favorite smells: gasoline, three-day-old cigarettes, cash money, pineapple, bleach, and dirt.  It smells awesome.  When you walk around, people stop and look at you as if to say “Is that you that I’m smelling?”  Well, folks, yes it is, and now, for the first time ever, you can smell like me, too.  I’m personally bottling it in 100% recycled water bottles that still have their original labels.  Just hook up a little squirt attachment to the top (sold separately) and spray away!  You can smell like Creed!  Your pet can smell like Creed!  Your home can smell like Creed!  Your car can smell like Creed!  Even your kids can smell like Creed!  Buy some CreedScents now!\n\nJust a little legal disclaimer:  Don’t drink CreedScents.  Don’t use CreedScents as a cleaning liquid.  CreedScents is not intended to touch the human skin.  If your skin comes into contact with CreedScents, immediately scrub the infected area for roughly one hour or else your skin may begin to melt.  CreedScents should not be inhaled.  Once in the bloodstream, CreedScents can do serious damage to both your brain and most of your major organs.  CreedScents should not be used as a narcotic, although it functions as one if distilled into a gel-cap.  Please do not distill CreedScents into gel-caps, as the narcotic it becomes is equivalent to a lethal combination of absinthe, lithium, and hemlock.  You may get high for a minute, but you’ll be dead forever.  By purchasing CreedScents, you agree to release me, Creed Bratton, from any legal action whatsoever.  Also, any problems not mentioned here that arise from the use of CreedScents shall be deemed “implied risks” and cannot be used against me, Creed Bratton, in any type of lawsuit.\n\nStop sitting on your fat ass and buy some CreedScents today!"
  },
  {
    "date": { "date": "May 08", "time": "09:15 AM" },
    "content": "There was a big blow-up at work last week between the boss man and the black guy.  Lots of fireworks.  I think the boss man broke out his brass knuckles because I saw a lot of blood on the carpet the next day.  Blood on the carpet means trouble – that’s a rule I live by.  I don’t like fights at work, because it’s too many parts of my life coming together in one place.  I prefer to keep fighting outside of work and my work out of fights.  This fight turned out pretty well for me, though, because everyone else got sent home so they could have a private cage match.\n\nThe first thing I did when we got sent home was head straight over to the mall for some orange chicken at the Lotus place.  That stuff is dynamite.  I could eat a shopping cart full of it.  Sadly, they don’t sell it by the shopping cart, no matter how often I ask them to, so I settled for a combo meal.  There were a few high school kids in the food court, so I tried to drum up some new customers for my novelty identification and lamination business.  They weren’t interested.  Apparently there’s some punk over at Scranton Prep who does a really good Delaware now.  Even better than my Georgia.  I’m going to track that kid down and have a “talk” with him.  When it comes to novelty identification and lamination, I need to be the only game in town.\n\nAfter the mall, I was pretty riled up, so I headed over to that “Just Paint It” place where you can paint your own pottery.  That place is like a zen garden to me.  I just sit down, grab a small ceramic elephant and go to town.  I can zone out for two, three hours painting that thing.  The best part about it is that when I’m done, I get to take it with me.  You’d be surprised how much you can get for an orange and green elephant when you tell people it’s imported from Indonesia.\n\nI spent the rest of the night over at the grocery store sampling the candy in the bulk bins.  They didn’t even hassle me about it.  Not that I really keep track, but that may have been my best day ever."
  },
  {
    "date": { "date": "May 01", "time": "09:16 AM" },
    "content": "Remember when I told you about those flashbacks I was having with my old dog Bozo?  Well guess what?  He’s back, or rather, she’s back.  I found a dog that looked just like Bozo wandering around Wilkes-Barre over the weekend by herself and I immediately snatched her up.  You might think it’s cruel to snatch a dog, but I say it’s the only way.  I got a real big sack with breathing holes cut all over it and then I coaxed her to walk into it by throwing about fifteen hot dogs in there.  Once she was in the sack, I took her home with me and we’ve been best friends ever since.  I’ve been thinking about fitting her for a saddle since she’s kind of big and I’ve been meaning to start a doggy ride business for carnivals anyway.\n\nDoggy rides were one of my favorite childhood pastimes.  Pony rides and elephant rides seem to be the most popular form of animal rides, but doggy rides are a lot more fun.  They’re like those mini-motorcycles that crazy idiots buy these days.  With a doggy ride, you never know where you’re going to end up: The dogs might take off like jack-rabbits when they see something or the dogs could just plop down and take a rest.  We used to call those Sitsies.  You could never get a refund for a Sitsie, but you’d always get a rain check.\n\nMy first step in dog ownership is training.  I’ve already trained my pooch to relax, bark at the doorbell, and drink water.  Pretty soon we’re going to work on pee in the house and growl.  She’s super smart, so she’s been picking everything up so quickly.  I really want to teach her to give me haircuts, but I’ve had bad luck giving animals hair clippers recently.\n\nPicking a name is the most important part of getting a new dog.  With a girl dog, you’ve got a few ways to go.  You can call her a traditional feminine name, like Molly or Annabelle, you can name her something that relates to the way she looks like Blackhead or Furry Paws, or you can name her based on something you really like.  That’s why I’m calling my dog “Hot.”  I love hot dogs.  Always have, even in my vegetarian days.  Now that I have my own little hot dog running around with me, I’ll be constantly reminded of her sausage-y goodness.  If you see Hot and me taking a stroll, come on over and say hi, but watch out.  I’m in the middle of training her to bite strangers."
  },
  {
    "date": { "date": "April 24", "time": "09:21 AM" },
    "content": "A lot of blue-collar guys have toolkits to help them do their jobs.  The kits got whatever tools they need to get their jobs done – hammers, screwdrivers, jaws of life, etc.  As a guy that doesn’t build things or fix things, you might think that I don’t need a toolkit, but you’d be wrong.  I have my own kit that I carry around with me every day and I’ve pared it down over the years to just the bare essentials.  \n\n1. Nail clippers.  I don’t know about you, but my nails grow crazy fast.  That’s not even why I carry the clippers, though.  Clippers are great when you need to cut something, like a wire or a chain, and you don’t want to be seen carrying something bigger.  Sure, they’re not the strongest things in the world, but trust me, they get the job done.  Not only that, but they provide a great cover for anything you’re doing.  Let’s say, hypothetically, that you’re trying to get in somewhere you’re not supposed to be and, all of a sudden, some fatso security guard comes walking through.  Do you freak out?  No way.  You just pull out your clippers and start clipping your nails.  Who are you?  Just a normal guy trying to work on his personal hygiene.  It’s perfect.\n\n2. Gauze.  Gauze is a great accessory.  If you get hurt, put gauze on it.  If you want to make people think that you’re hurt, wrap a little gauze anywhere on your body and boom – instant sympathy.  Nobody ever bothers to look under gauze.  Ever.  If you get tired, just whip out that roll of gauze and use it as a pillow.  It’s incredibly soft.  I’m not even getting into its obvious uses as a bathroom helper.  You know what I mean.\n\n3. Business cards.  They don’t have to say your name on them.  Mine don’t.  Mine say a bunch of other people’s names.  I just pick up a few every time I see a stack of them somewhere.  The point isn’t to tell someone who you are, it’s to tell them that you’re a professional.  When you hand someone a business card, they know you mean business.  That’s why they’re called business cards.  \n\nMy toolkit comes in handy almost every day.  I don’t go anywhere with it.  Now that you know what’s in my toolkit, I’ve got to ask – what’s in your toolkit?"
  },
  {
    "date": { "date": "April 17", "time": "09:23 AM" },
    "content": "I’m sorry to say it, but I stopped writing my yeti story.  It just got to be too much of a hassle for me.  I mean, I’ve already got a job.  Who needs two jobs, you know?  I realized that I never became an adventure writer because every time I tried, I’d get bored and the whole thing would fizzle out.  In case you were wondering, young Creed was going to capture the yeti and put him in an airplane circus and become a millionaire.  It made me kind of depressed just thinking about it because I should be a millionaire, but I’ve never been able to find any yetis to capture.  I’ve still got time, though, I suppose.\n\nI’m sorry to say it, but I stopped writing my yeti story.  It just got to be too much of a hassle for me.  I mean, I’ve already got a job.  Who needs two jobs, you know?  I realized that I never became an adventure writer because every time I tried, I’d get bored and the whole thing would fizzle out.  In case you were wondering, young Creed was going to capture the yeti and put him in an airplane circus and become a millionaire.  It made me kind of depressed just thinking about it because I should be a millionaire, but I’ve never been able to find any yetis to capture.  I’ve still got time, though, I suppose.\n\nThe reason I wanted to write about yetis in the first place is that they fascinate me.  They live exactly the life I want to lead.  They rarely interact with humans, they live in the forest, and once in a while they pop up in pictures from your camping trip.  The only difference is that I don’t want to have hair all over like that.  My father was a hairy guy and it didn’t really do him any good.  I prefer to be smooth.  Other than that, sign me up for life as a yeti.  Also, I could make some sweet cash off of selling photos of myself to tabloids.  A self-sustaining business like that is the way to go.  I’d be like a model, but more dangerous and less cheek-boney.\nI thought about being a model when I was younger.  I used to look a lot like Twiggy and thought I could make a name for myself as a male Twiggy with a lot of really cool birthmarks.  Apparently the market wasn’t ready for me.  I got a job as a model for an avant garde theatre and muffin company in New York City and when the ads came out, they were banned instantly because people were getting ill looking at the pictures of muffins strategically placed around my naked body.  It was the sixties, man.  We thought it was going to turn the muffin industry on its head, but instead it just turned a lot of stomachs.  Live and learn.  Learn and love.  Love and live.  Peace.\n\nThe reason I wanted to write about yetis in the first place is that they fascinate me.  They live exactly the life I want to lead.  They rarely interact with humans, they live in the forest, and once in a while they pop up in pictures from your camping trip.  The only difference is that I don’t want to have hair all over like that.  My father was a hairy guy and it didn’t really do him any good.  I prefer to be smooth.  Other than that, sign me up for life as a yeti.  Also, I could make some sweet cash off of selling photos of myself to tabloids.  A self-sustaining business like that is the way to go.  I’d be like a model, but more dangerous and less cheek-boney.\n\nI thought about being a model when I was younger.  I used to look a lot like Twiggy and thought I could make a name for myself as a male Twiggy with a lot of really cool birthmarks.  Apparently the market wasn’t ready for me.  I got a job as a model for an avant garde theatre and muffin company in New York City and when the ads came out, they were banned instantly because people were getting ill looking at the pictures of muffins strategically placed around my naked body.  It was the sixties, man.  We thought it was going to turn the muffin industry on its head, but instead it just turned a lot of stomachs.  Live and learn.  Learn and love.  Love and live.  Peace."
  },
  {
    "date": { "date": "April 10", "time": "12:17 PM" },
    "content": "So last week I shared the first part of my adventure story, Creed and the One-Armed Yeti Pilot, and I know I left you all wanting more.  If you missed last week’s story, go back and catch up or else none of this will make sense to you.  I’ll wait.\nNow that you’re all caught up, here it is, the moment you’ve been waiting for like those Paddle Off dogs who wait for the bell to get hungry: Creed and the One-Armed Yeti Pilot Part Two: The One-Armed Yeti’s Lair.\n\nSo last week I shared the first part of my adventure story, Creed and the One-Armed Yeti Pilot, and I know I left you all wanting more.  If you missed last week’s story, go back and catch up or else none of this will make sense to you.  I’ll wait.\n\nNow that you’re all caught up, here it is, the moment you’ve been waiting for like those Paddle Off dogs who wait for the bell to get hungry: Creed and the One-Armed Yeti Pilot Part Two: The One-Armed Yeti’s Lair.\n\n**********************************************************************************************************************\nCreed and the One-Armed Yeti Pilot\nPart Two\nThe One-Armed Yeti’s Lair\nFor what seemed like hours, Creed had been tripping out and thinking he was enjoying a fun day at a water park, splashing and running around.  In actuality, Creed was being dragged through the forest by a one-armed yeti who was slobbering and sweating all over him.  It was pretty terrible.  Yeti sweat smells a lot like a petting zoo and that’s exactly what Creed smelled like when he woke up.  He was lucky though, because if it wasn’t for the smell, he might never have ever woken up at all.  Most yeti slaps prove to be fatal.\nCreed opened his eyes and looked around, wondering what strange place surrounded him.  He also wondered where he could find the petting zoo that smelled like it was close by.  Creed had always enjoyed petting llamas.  Creed sat in what appeared to be a row of seats inside a narrow tube of some sort.  It was very dark, but his eyes could make out several rows of seats in front of him.  His legs were cramped as there wasn’t a lot of legroom for him to stretch out.  He stood up quickly and the pain of not moving his legs for hours attacked him like needles that sprouted from his leg like sharp grass.  Creed yelped and fell back into his seat.\nAll of a sudden, a door opened in front of Creed and the one-armed yeti emerged, but this time he was wearing a scarf and a pair of goggles.\n“Where am I?” asked Creed, his legs still smarting from standing up.\n“You’re in my lair.  Well, my Lairplane, to be exact.  I live inside a small airplane,” explained the yeti, who appeared much friendlier than before.\n“Wait.  Didn’t you say before that you didn’t talk?”  Creed looked at him inquisitively.\n“I just didn’t feel like talking before.  Most people don’t question it.”  The yeti looked upset and rightfully so.  He hated being questioned.\nThe yeti went on to explain that he lived inside the airplane because he used to be a pilot.  The plane used to be his, but it crashed in the forest many years ago and he had been living inside of it ever since.  Creed was fascinated by the yeti’s stories, especially the ones about making friends with many of the forest creatures.  In the middle of one of the stories, a raccoon came into the airplane to ask the yeti a question.  Creed couldn’t understand the raccoon because he couldn’t talk to animals, but the yeti could.  Young Creed got to thinking that he could make a lot of money off of the yeti if he could capture it and turn it into an animal interpreter.  First, however, he had to find a way to capture it.\nTo Be Continued...\n**********************************************************************************************************************\n\n**********************************************************************************************************************\nCreed and the One-Armed Yeti Pilot\nPart Two\nThe One-Armed Yeti’s Lair\n\nCreed and the One-Armed Yeti Pilot\nPart Two\nThe One-Armed Yeti’s Lair\n\nFor what seemed like hours, Creed had been tripping out and thinking he was enjoying a fun day at a water park, splashing and running around.  In actuality, Creed was being dragged through the forest by a one-armed yeti who was slobbering and sweating all over him.  It was pretty terrible.  Yeti sweat smells a lot like a petting zoo and that’s exactly what Creed smelled like when he woke up.  He was lucky though, because if it wasn’t for the smell, he might never have ever woken up at all.  Most yeti slaps prove to be fatal.\n\nCreed opened his eyes and looked around, wondering what strange place surrounded him.  He also wondered where he could find the petting zoo that smelled like it was close by.  Creed had always enjoyed petting llamas.  Creed sat in what appeared to be a row of seats inside a narrow tube of some sort.  It was very dark, but his eyes could make out several rows of seats in front of him.  His legs were cramped as there wasn’t a lot of legroom for him to stretch out.  He stood up quickly and the pain of not moving his legs for hours attacked him like needles that sprouted from his leg like sharp grass.  Creed yelped and fell back into his seat.\n\nAll of a sudden, a door opened in front of Creed and the one-armed yeti emerged, but this time he was wearing a scarf and a pair of goggles.\n\n“Where am I?” asked Creed, his legs still smarting from standing up.\n“You’re in my lair.  Well, my Lairplane, to be exact.  I live inside a small airplane,” explained the yeti, who appeared much friendlier than before.\n“Wait.  Didn’t you say before that you didn’t talk?”  Creed looked at him inquisitively.\n“I just didn’t feel like talking before.  Most people don’t question it.”  The yeti looked upset and rightfully so.  He hated being questioned.\n\nThe yeti went on to explain that he lived inside the airplane because he used to be a pilot.  The plane used to be his, but it crashed in the forest many years ago and he had been living inside of it ever since.  Creed was fascinated by the yeti’s stories, especially the ones about making friends with many of the forest creatures.  In the middle of one of the stories, a raccoon came into the airplane to ask the yeti a question.  Creed couldn’t understand the raccoon because he couldn’t talk to animals, but the yeti could.  Young Creed got to thinking that he could make a lot of money off of the yeti if he could capture it and turn it into an animal interpreter.  First, however, he had to find a way to capture it.\n\nTo Be Continued..."
  },
  {
    "date": { "date": "April 03", "time": "12:17 PM" },
    "content": "I grew up reading adventure stories in the back of comic books and my whole life I’ve wanted to write those suckers, so this weekend, I decided I was really going to do it.  I said “I’m going to follow my dreams and write adventure stories in the back of comic books!”  That is, until I found out that comic books don’t have adventure stories written in the back of them anymore.  Apparently, it’s a lost art.  Pretty sad, really.  Also, the comic books these days are racy.  They’re like pornos.  I was shocked.  I’m a pretty liberal guy, all things considered, but the stuff these cartoonguys do to robots and octopi.  Man oh man.  It’s pretty sick.  Anyway, I decided to start writing an adventure story anyway.  I hope you like it.\n\nI grew up reading adventure stories in the back of comic books and my whole life I’ve wanted to write those suckers, so this weekend, I decided I was really going to do it.  I said “I’m going to follow my dreams and write adventure stories in the back of comic books!”  That is, until I found out that comic books don’t have adventure stories written in the back of them anymore.  Apparently, it’s a lost art.  Pretty sad, really.  Also, the comic books these days are racy.  They’re like pornos.  I was shocked.  I’m a pretty liberal guy, all things considered, but the stuff these cartoonguys do to robots and octopi.  Man oh man.  It’s pretty sick.  Anyway, I decided to start writing an adventure story anyway.  I hope you like it.\n\n**********************************************************************************************************************\nCreed and the One-Armed Yeti Pilot\nCreed walked along the forest floor, hunting for arrowheads left behind by the Indians that used to call this forest home.  He was a tall boy with thick blond hair that sprouted from his head like golden grass.  Without many friends, Creed liked to wander the forest by himself, exploring nature’s secrets and discovering artifacts left behind by people long ago.  He could hear the brook gurgling up ahead, so he decided to see how fast he could run there.\nHe took off quickly, feeling the wind brush against his face as he passed by tree after tree.  He was almost at the brook when something hit him in the face.  Creed tumbled to the ground with a thump.  When he looked up, he saw something he never thought he would see.  A one-armed yeti was standing over him.  The yeti was tall with thick white hair that sprouted from his body like snowy grass.  He made a loud noise that sounded like a yak belch.  The strangest thing about the yeti was that it only had one arm and the arm came right out of his chest.  Creed stood up to talk to the yeti.\n“Why’d you hit me?” Creed asked, timidly.\n“I’m a yeti.  I do not talk,” replied the yeti.\n“But… you just did,”  said Creed, reaching out to touch the yeti’s fur.\nThe yeti let out a fearsome roar and hit Creed in the face with his yeti paw.  Creed fell back to the ground unconscious and started tripping out real bad.\nTo Be Continued...\n**********************************************************************************************************************\n\n**********************************************************************************************************************\nCreed and the One-Armed Yeti Pilot\n\nCreed and the One-Armed Yeti Pilot\n\nCreed walked along the forest floor, hunting for arrowheads left behind by the Indians that used to call this forest home.  He was a tall boy with thick blond hair that sprouted from his head like golden grass.  Without many friends, Creed liked to wander the forest by himself, exploring nature’s secrets and discovering artifacts left behind by people long ago.  He could hear the brook gurgling up ahead, so he decided to see how fast he could run there.\n\nHe took off quickly, feeling the wind brush against his face as he passed by tree after tree.  He was almost at the brook when something hit him in the face.  Creed tumbled to the ground with a thump.  When he looked up, he saw something he never thought he would see.  A one-armed yeti was standing over him.  The yeti was tall with thick white hair that sprouted from his body like snowy grass.  He made a loud noise that sounded like a yak belch.  The strangest thing about the yeti was that it only had one arm and the arm came right out of his chest.  Creed stood up to talk to the yeti.\n\n“Why’d you hit me?” Creed asked, timidly.\n“I’m a yeti.  I do not talk,” replied the yeti.\n“But… you just did,”  said Creed, reaching out to touch the yeti’s fur.\n\nThe yeti let out a fearsome roar and hit Creed in the face with his yeti paw.  Creed fell back to the ground unconscious and started tripping out real bad.\n\nTo Be Continued..."
  },
  {
    "date": { "date": "March 27", "time": "12:14 PM" },
    "content": "When will all these crazy dreams stop?  They’ve been going on for at least a week and every night they get crazier and crazier.  Usually I try to use my dreams to figure out stuff that’s going to happen in the future like lottery numbers and horse race winners, but recently my subconscious has declared war on my brain. \nA week ago Wednesday I went to sleep after drinking my nightly bedtime cocktail – triple sec, bitters, grape juice, and two bottles of Nyquil – and all of a sudden I was thrown into the strangest dream I ever had.  I was a seahorse broad living in this underground suburban housing community and I was making dinner for my little seahorse kids until my husband came home and said he was taking us all for a seahorse celebration because he got promoted at the real estate office.  We went to this fancy buffet where they only served kelp and then one of my little seaponies turned into a skyscraper and I was standing on top of him looking for my shoes (which had fallen to the ground below).  That’s when I heard a siren and woke up.  I didn’t think anything of it, but the next night, the dream continued.\n\nWhen will all these crazy dreams stop?  They’ve been going on for at least a week and every night they get crazier and crazier.  Usually I try to use my dreams to figure out stuff that’s going to happen in the future like lottery numbers and horse race winners, but recently my subconscious has declared war on my brain. \n\nA week ago Wednesday I went to sleep after drinking my nightly bedtime cocktail – triple sec, bitters, grape juice, and two bottles of Nyquil – and all of a sudden I was thrown into the strangest dream I ever had.  I was a seahorse broad living in this underground suburban housing community and I was making dinner for my little seahorse kids until my husband came home and said he was taking us all for a seahorse celebration because he got promoted at the real estate office.  We went to this fancy buffet where they only served kelp and then one of my little seaponies turned into a skyscraper and I was standing on top of him looking for my shoes (which had fallen to the ground below).  That’s when I heard a siren and woke up.  I didn’t think anything of it, but the next night, the dream continued.\n\nThis time, I was still a seahorse, but I was on top of the Sears Tower in Chicago and I was giving tours to Croatian tourists who wanted to know where they could find hot dogs.  I kept saying “Just look around, Croats, they’re everywhere!”  But they kept on asking.  Finally, I grabbed one of the foreigners and pulled them to the edge while I pointed to about a million hot dog stands on the street below us.  That’s when the building turned back into my seahorse son and all of a sudden I was back at the kelp buffet, but one of my waiters was the pesky Croatian.  Weird, right?\nSo every night since, I’ve been drinking the same cocktail and going to sleep right away and the dreams just keep getting more and more out of control.  Now they involve a seahorse orchestra, a family of very tiny bears who love to swim, Croatian folksongs, blankets made out of submerged power lines, and an elaborate conspiracy to take over the Sea Monarchy by a very large network of algae.  Seriously, if you know what any of this means, please let me know.  I think I might have to eat a seahorse to make it all go away, but the last time I ate a horse of any sort, I had a really bad reaction so I want to avoid that if I can.  Thank you in advance for your help.\n\nThis time, I was still a seahorse, but I was on top of the Sears Tower in Chicago and I was giving tours to Croatian tourists who wanted to know where they could find hot dogs.  I kept saying “Just look around, Croats, they’re everywhere!”  But they kept on asking.  Finally, I grabbed one of the foreigners and pulled them to the edge while I pointed to about a million hot dog stands on the street below us.  That’s when the building turned back into my seahorse son and all of a sudden I was back at the kelp buffet, but one of my waiters was the pesky Croatian.  Weird, right?\n\nSo every night since, I’ve been drinking the same cocktail and going to sleep right away and the dreams just keep getting more and more out of control.  Now they involve a seahorse orchestra, a family of very tiny bears who love to swim, Croatian folksongs, blankets made out of submerged power lines, and an elaborate conspiracy to take over the Sea Monarchy by a very large network of algae.  Seriously, if you know what any of this means, please let me know.  I think I might have to eat a seahorse to make it all go away, but the last time I ate a horse of any sort, I had a really bad reaction so I want to avoid that if I can.  Thank you in advance for your help."
  },
  {
    "date": { "date": "March 20", "time": "09:00 AM" },
    "content": "There are two words that make my heart beat like a giraffe approaching a highway underpass.  “Internet” and “dating.”  When you put them together, I’m likely to go into convulsions.  Up until last week, internet dating was number four on my most-current list of fears.  It’s topped only by French-Canadian clowns that don’t wear pants, bodies of water where I can’t see the bottom, and my three remaining uncles.  I’ve been on a mission to conquer these fears and that’s why I decided to give internet dating a shot.\nMy romance needs are real specific, so I didn’t know if these internet dating sites would be able to handle a dude like me.  As a product of the free-love generation, I’ve still got some free-love souvenirs hanging around my free-love toolkit and I need a lady who doesn’t mind a few bumps on the free-love highway, so to speak.  Lots of sites claim to help you find the perfect person for your particular needs, but I didn’t believe it until I actually tried them out.  Did you know there are actually places to go for people in my… situation?  There are.  More than you’d imagine.\n\nThere are two words that make my heart beat like a giraffe approaching a highway underpass.  “Internet” and “dating.”  When you put them together, I’m likely to go into convulsions.  Up until last week, internet dating was number four on my most-current list of fears.  It’s topped only by French-Canadian clowns that don’t wear pants, bodies of water where I can’t see the bottom, and my three remaining uncles.  I’ve been on a mission to conquer these fears and that’s why I decided to give internet dating a shot.\n\nMy romance needs are real specific, so I didn’t know if these internet dating sites would be able to handle a dude like me.  As a product of the free-love generation, I’ve still got some free-love souvenirs hanging around my free-love toolkit and I need a lady who doesn’t mind a few bumps on the free-love highway, so to speak.  Lots of sites claim to help you find the perfect person for your particular needs, but I didn’t believe it until I actually tried them out.  Did you know there are actually places to go for people in my… situation?  There are.  More than you’d imagine.\n\nI posted my profile up on one of the sites a week ago – don’t ask me which one because I don’t post and tell.  Within a day, all these people sent me messages saying they wanted to buy me dinner and take me to Italy and all kinds of crazy stuff.  That’s when I realized I had signed up as a 30 to 45 year-old woman looking for a man in his sixties with lots of issues.  Apparently I mixed up the “who I am” section with the “who I’m looking for.”  What can I say?  It was confusing and I filled it out fast.  So I deleted all those messages (after a few really nice dinners with some surprisingly friendly but embarrassed guys) and started over with the right information.  The messages haven’t been pouring in this time, but there’s a really nice looking gal from Altoona that seems promising.  She’s got nearly everything I’m looking for/have contracted over the years, so it seems like a good match.  We’re going to go out next week and I’ve been spending most of my time trying to figure out how I can get her to pay.\nAll in all, I’m pretty happy to report that I’m crossing internet dating off of my list of fears.  It seems lot more manageable now that I’ve tried it a little.  Next on my list are those pant-less French-Canadian clowns and I have no idea how to get over that fear.  My only idea right now involves a very small Peugeot with a lot of seltzer and a pocket-sized French dictionary.  I’ll let you know how it goes.\n\nI posted my profile up on one of the sites a week ago – don’t ask me which one because I don’t post and tell.  Within a day, all these people sent me messages saying they wanted to buy me dinner and take me to Italy and all kinds of crazy stuff.  That’s when I realized I had signed up as a 30 to 45 year-old woman looking for a man in his sixties with lots of issues.  Apparently I mixed up the “who I am” section with the “who I’m looking for.”  What can I say?  It was confusing and I filled it out fast.  So I deleted all those messages (after a few really nice dinners with some surprisingly friendly but embarrassed guys) and started over with the right information.  The messages haven’t been pouring in this time, but there’s a really nice looking gal from Altoona that seems promising.  She’s got nearly everything I’m looking for/have contracted over the years, so it seems like a good match.  We’re going to go out next week and I’ve been spending most of my time trying to figure out how I can get her to pay.\n\nAll in all, I’m pretty happy to report that I’m crossing internet dating off of my list of fears.  It seems lot more manageable now that I’ve tried it a little.  Next on my list are those pant-less French-Canadian clowns and I have no idea how to get over that fear.  My only idea right now involves a very small Peugeot with a lot of seltzer and a pocket-sized French dictionary.  I’ll let you know how it goes."
  },
  {
    "date": { "date": "March 13", "time": "09:23 AM" },
    "content": "What’s better than a nice, hot bath?  Almost nothing except for a nice, hot bath with a foxy lady and some fine aged Dominican cigars.  You can get Dominican stogies almost anywhere, but I still like to smuggle them in.  It gives me a sense of accomplishment when I smoke them.  Makes me feel proud.  \nWhen I’m sitting in that tub, I light one up and enjoy it for hours.  I don’t mind the water wrinkles I get from staying in there too long, because hey, I’ve got enough wrinkles of my own so who am I to complain?  Plus, when I park my kiester in that tub long enough, I feel like I’m just another part of the water so it doesn’t even matter that I have skin in the first place.  I like to pretend I’m just a merman enjoying my aqua bounty.\n\nWhat’s better than a nice, hot bath?  Almost nothing except for a nice, hot bath with a foxy lady and some fine aged Dominican cigars.  You can get Dominican stogies almost anywhere, but I still like to smuggle them in.  It gives me a sense of accomplishment when I smoke them.  Makes me feel proud.  \n\nWhen I’m sitting in that tub, I light one up and enjoy it for hours.  I don’t mind the water wrinkles I get from staying in there too long, because hey, I’ve got enough wrinkles of my own so who am I to complain?  Plus, when I park my kiester in that tub long enough, I feel like I’m just another part of the water so it doesn’t even matter that I have skin in the first place.  I like to pretend I’m just a merman enjoying my aqua bounty.\n\nDon’t get me wrong; I’m not an actual merman.  Mermen are terrible bastards and I don’t want to be associated with them in any way.  Most people think that they’re dolphins, because they wear dolphin masks to blend in, but they’re actually a ruthless breed of greedy webbed-leg pirates who attack sailors and make them give up their citrus.  Why do you think dolphins are considered mammals?  It’s because when those sea doctors try to study them, they keep on catching mermen dressed up as dolphins.  Real dolphins are fish, like enormous tuna, which is why I don’t understand why people make such a fuss about dolphin-safe tuna.  Dolphin is the best kind of tuna, people.  If you want a tasty sandwich, you’d get yourself some tuna-safe dolphin.  Trust me on this one.\nBack to baths for a second.  I like baths so much more than showers.  I mean, who likes standing under a hose when you can be sitting in a miniature swimming pool?  When you take a bath, you’re making a commitment to cleanliness because baths get the job done.  That’s why my weekly bath is one of the most important things I do.  Stay clean, people, otherwise rubes can smell you when you sneak up behind them.\n\nDon’t get me wrong; I’m not an actual merman.  Mermen are terrible bastards and I don’t want to be associated with them in any way.  Most people think that they’re dolphins, because they wear dolphin masks to blend in, but they’re actually a ruthless breed of greedy webbed-leg pirates who attack sailors and make them give up their citrus.  Why do you think dolphins are considered mammals?  It’s because when those sea doctors try to study them, they keep on catching mermen dressed up as dolphins.  Real dolphins are fish, like enormous tuna, which is why I don’t understand why people make such a fuss about dolphin-safe tuna.  Dolphin is the best kind of tuna, people.  If you want a tasty sandwich, you’d get yourself some tuna-safe dolphin.  Trust me on this one.\n\nBack to baths for a second.  I like baths so much more than showers.  I mean, who likes standing under a hose when you can be sitting in a miniature swimming pool?  When you take a bath, you’re making a commitment to cleanliness because baths get the job done.  That’s why my weekly bath is one of the most important things I do.  Stay clean, people, otherwise rubes can smell you when you sneak up behind them."
  },
  {
    "date": { "date": "March 06", "time": "09:19 AM" },
    "content": "A lot of people say that when you get to be my age, it’s much harder to stay in shape.  What a load of poppycock.  Just look at me.  I’m a machine.  Based on my own measurements, I have roughly 2% body fat.  I’m so cut, I could model for Italian sculptors.  If the government wanted to, they could build robot soldiers in my likeness.  So don’t go telling me that it’s hard to stay fit.\nMy diet is pretty simple.  Mung beans for breakfast, mung beans for lunch, and then a sensible dinner – usually comprised of more mung beans.  For beverages, I only drink water or whiskey and when I’m drinking whiskey, it’s usually when I’m working out.  It gives me the courage to lift more than I can when I’m sober.\n\nA lot of people say that when you get to be my age, it’s much harder to stay in shape.  What a load of poppycock.  Just look at me.  I’m a machine.  Based on my own measurements, I have roughly 2% body fat.  I’m so cut, I could model for Italian sculptors.  If the government wanted to, they could build robot soldiers in my likeness.  So don’t go telling me that it’s hard to stay fit.\n\nMy diet is pretty simple.  Mung beans for breakfast, mung beans for lunch, and then a sensible dinner – usually comprised of more mung beans.  For beverages, I only drink water or whiskey and when I’m drinking whiskey, it’s usually when I’m working out.  It gives me the courage to lift more than I can when I’m sober.\n\nEvery month or so, I’ll invent a new diet for myself that I stick to for about a week.  Last month, I only ate watermelon seeds and bacon fat.  This month, I’m thinking of trying out a squirrel diet: acorns, berries, assorted tree leaves, and, of course, squirrel.  I’ll let you know how it goes.\nThe real secret to my success is my workout regimen.  I do all my lifting in the office at night after everyone leaves.  First I start with my sit-downs.  I stand up and sit down on my chair twenty-five times or until I can’t whistle.  Then I move over to the break room to do my patented Vending Machine Push.  It’s real simple – just tip the vending machine towards you and push it towards the wall without letting it actually tip back onto its base.  I’ll do this until I feel like I’m going to die.  Then I do two more and slam that puppy back against the wall.  The Vending Machine Push actually has two purposes.  It makes your chest flat like Heston’s in Ben-Hur and you get a lot of free snacks because they rattle loose when you’re doing all the pushing.  It’s the most valuable part of my workout.  I usually finish up by doing sprints through the kitchen, but last week some numbnuts spilled coffee on the floor and I took a pretty nasty tumble.  I was really pissed until I remembered that I was the one who spilled the coffee.  Let that be a lesson to us all: don’t fall into traps you set for your co-workers.\n\nEvery month or so, I’ll invent a new diet for myself that I stick to for about a week.  Last month, I only ate watermelon seeds and bacon fat.  This month, I’m thinking of trying out a squirrel diet: acorns, berries, assorted tree leaves, and, of course, squirrel.  I’ll let you know how it goes.\n\nThe real secret to my success is my workout regimen.  I do all my lifting in the office at night after everyone leaves.  First I start with my sit-downs.  I stand up and sit down on my chair twenty-five times or until I can’t whistle.  Then I move over to the break room to do my patented Vending Machine Push.  It’s real simple – just tip the vending machine towards you and push it towards the wall without letting it actually tip back onto its base.  I’ll do this until I feel like I’m going to die.  Then I do two more and slam that puppy back against the wall.  The Vending Machine Push actually has two purposes.  It makes your chest flat like Heston’s in Ben-Hur and you get a lot of free snacks because they rattle loose when you’re doing all the pushing.  It’s the most valuable part of my workout.  I usually finish up by doing sprints through the kitchen, but last week some numbnuts spilled coffee on the floor and I took a pretty nasty tumble.  I was really pissed until I remembered that I was the one who spilled the coffee.  Let that be a lesson to us all: don’t fall into traps you set for your co-workers."
  },
  {
    "date": { "date": "February 28", "time": "10:19 AM" },
    "content": "So guess who didn’t watch the Academy Awards last weekend?  Me.  I was too busy selling my TV for a case of hand towels.  The story’s way too long and my arthritis has been acting up so I’m not going to write about it here.  Needless to say, I’ve got a lot of hand towels now and I’m only a little bit upset that I missed the Oscars.  Doesn’t matter, though.  I’ve got my own awards to give out.  Ladies and Gentlemen, I present to you The First Annual Bratton Awards, chosen by me.  For the record, nobody’s getting a gold statue or anything.  If I had gold statues lying around, I’d melt them down and sell them for cashola.  On to the awards!\nThe Fatso Award goes to…\n\nSo guess who didn’t watch the Academy Awards last weekend?  Me.  I was too busy selling my TV for a case of hand towels.  The story’s way too long and my arthritis has been acting up so I’m not going to write about it here.  Needless to say, I’ve got a lot of hand towels now and I’m only a little bit upset that I missed the Oscars.  Doesn’t matter, though.  I’ve got my own awards to give out.  Ladies and Gentlemen, I present to you The First Annual Bratton Awards, chosen by me.  For the record, nobody’s getting a gold statue or anything.  If I had gold statues lying around, I’d melt them down and sell them for cashola.  On to the awards!\n\nThe Fatso Award goes to…\n\nFatso.  In accounting.  This one was a no-brainer.  That dude is heavy.  I don’t want to make him mad though, because I eat a lot his M&Ms when he leaves for the day.  If you’re reading this, Fatso, I’m talking about the other Fatso in accounting.  The one with all the hair.  Not you.\nThe Katharine Ross Award goes to…\nThe Receptionist girl – Penny!  She’s everything that Katharine Ross was in The Graduate.  I don’t really remember much about the movie, but I do know that she was a foxy lady and so is the receptionist girl.  Plus, she has a hot mom.\nThe Black Guy Award goes to…\nNobody.  I wanted to give it to Stan, but he really cheesed me off today when we were both in the kitchen and he took the last Sleepytime tea bag without even asking me if I wanted it, so I disqualified him.  I guess I could give it to the security guard downstairs, but that guy’s kind of a jerk, too.  There’s always next year, black guys.\nThe Lifetime Achievement Award goes to…\nMy shoes.  I’ve had them since 1987.  That’s a lifetime for a pair of shoes.  The soles wore through in the mid-nineties, but I just duct-taped the hell out of them and they’ve been fine ever since.  Thanks a lot, shoes!\nLook, my arthritis just flared up real bad again, so I’m calling it quits.  Check back next year for The Second Annual Bratton Awards.  I think I’ll start calling them The Creedos.\n\nFatso.  In accounting.  This one was a no-brainer.  That dude is heavy.  I don’t want to make him mad though, because I eat a lot his M&Ms when he leaves for the day.  If you’re reading this, Fatso, I’m talking about the other Fatso in accounting.  The one with all the hair.  Not you.\n\nThe Katharine Ross Award goes to…\n\nThe Receptionist girl – Penny!  She’s everything that Katharine Ross was in The Graduate.  I don’t really remember much about the movie, but I do know that she was a foxy lady and so is the receptionist girl.  Plus, she has a hot mom.\n\nThe Black Guy Award goes to…\n\nNobody.  I wanted to give it to Stan, but he really cheesed me off today when we were both in the kitchen and he took the last Sleepytime tea bag without even asking me if I wanted it, so I disqualified him.  I guess I could give it to the security guard downstairs, but that guy’s kind of a jerk, too.  There’s always next year, black guys.\n\nThe Lifetime Achievement Award goes to…\n\nMy shoes.  I’ve had them since 1987.  That’s a lifetime for a pair of shoes.  The soles wore through in the mid-nineties, but I just duct-taped the hell out of them and they’ve been fine ever since.  Thanks a lot, shoes!\n\nLook, my arthritis just flared up real bad again, so I’m calling it quits.  Check back next year for The Second Annual Bratton Awards.  I think I’ll start calling them The Creedos."
  },
  {
    "date": { "date": "February 21", "time": "08:40 AM" },
    "content": "Family gatherings are fantastic.  They’re a time for relatives to come together and enjoy each other’s company.  I don’t see my family much (for various reasons: jail, voluntary institutionalization, mercenary work), so I spend my time with other families on their happiest days.  It really brings a lot of joy to my weekends.\nThe Radisson in downtown Scranton has these nice banquet rooms that people rent out for weddings or baptisms or reunions or whatever else they want to celebrate with their families.  On Saturday mornings, I put on one of my work suits and head over to see what they’ve got going on.  It’s really easy to figure out because there are these signs they put up in the lobby telling you who and what is going on in each of the banquet rooms.  One week it might be the Yomimuri Family Reunion and Nathan’s Bar Mitzvah, the next week it’s Jimmy Kerry’s 40th Birthday Bash and a pancake breakfast from the Rotary Club.  I like to think of it like Banquet Hall Roulette and I look forward to it all week – especially the Bar Mitzvahs.  Those are a gas.\n\nFamily gatherings are fantastic.  They’re a time for relatives to come together and enjoy each other’s company.  I don’t see my family much (for various reasons: jail, voluntary institutionalization, mercenary work), so I spend my time with other families on their happiest days.  It really brings a lot of joy to my weekends.\n\nThe Radisson in downtown Scranton has these nice banquet rooms that people rent out for weddings or baptisms or reunions or whatever else they want to celebrate with their families.  On Saturday mornings, I put on one of my work suits and head over to see what they’ve got going on.  It’s really easy to figure out because there are these signs they put up in the lobby telling you who and what is going on in each of the banquet rooms.  One week it might be the Yomimuri Family Reunion and Nathan’s Bar Mitzvah, the next week it’s Jimmy Kerry’s 40th Birthday Bash and a pancake breakfast from the Rotary Club.  I like to think of it like Banquet Hall Roulette and I look forward to it all week – especially the Bar Mitzvahs.  Those are a gas.\n\nIt’s amazing how just being in a room full of happy people can really rub off on you.  When I leave the gatherings, or get kicked out as the case may be, I feel giddy.  I start smiling like I’m a squirrel at a baseball game where the peanut vendor trips on one of the steps in the aisle and drops all of his peanut bags on the ground, which leads to a frenzy of Cub Scouts trying to pick up all the bags because they’re really hungry from all the walking they did to find their seats but none of their parents gave them money because they’re from a pretty poor area and they don’t have a lot of disposable income to be wasting on snacks at a baseball game, even though one of the kids, Mario, had a chocolate-chip granola bar that he didn’t tell anyone about because he knew he’d have to share it with the rest of his den and he didn’t even really like the kids that much because they always called him “Super Mario Brothers” and teased him for bringing his pet squirrel to Cub Scout events even though the squirrel was pretty cool and tame and smiled whenever something out of the ordinary happened.  So basically, whenever l leave a happy family gathering, I feel like that squirrel.\n\nIt’s amazing how just being in a room full of happy people can really rub off on you.  When I leave the gatherings, or get kicked out as the case may be, I feel giddy.  I start smiling like I’m a squirrel at a baseball game where the peanut vendor trips on one of the steps in the aisle and drops all of his peanut bags on the ground, which leads to a frenzy of Cub Scouts trying to pick up all the bags because they’re really hungry from all the walking they did to find their seats but none of their parents gave them money because they’re from a pretty poor area and they don’t have a lot of disposable income to be wasting on snacks at a baseball game, even though one of the kids, Mario, had a chocolate-chip granola bar that he didn’t tell anyone about because he knew he’d have to share it with the rest of his den and he didn’t even really like the kids that much because they always called him “Super Mario Brothers” and teased him for bringing his pet squirrel to Cub Scout events even though the squirrel was pretty cool and tame and smiled whenever something out of the ordinary happened.  So basically, whenever l leave a happy family gathering, I feel like that squirrel."
  },
  {
    "date": { "date": "February 14", "time": "08:00 AM" },
    "content": "Love is in the air and I’ve got to find a way to bottle it because I’d make a killing. \n\nMost years on Valentine’s Day, I like to dress up in a little diaper and walk around with a bow and arrow shooting at happy couples.  I intentionally miss because I don’t want to go to jail or see anybody get hurt, but sometimes I’d just like to nail those nitwits in the forehead for rubbing their relationships in everybody’s faces.  Other days, I ditch the bow and arrow but I stick with the diapers because it’s a lot easier than finding a water closet every time I have to go potty.\n\nI want to know why St. Valentine got a holiday but St. Louis just got a crappy city.\n\n\nLove is in the air and I’ve got to find a way to bottle it because I’d make a killing. \n\n\nMost years on Valentine’s Day, I like to dress up in a little diaper and walk around with a bow and arrow shooting at happy couples.  I intentionally miss because I don’t want to go to jail or see anybody get hurt, but sometimes I’d just like to nail those nitwits in the forehead for rubbing their relationships in everybody’s faces.  Other days, I ditch the bow and arrow but I stick with the diapers because it’s a lot easier than finding a water closet every time I have to go potty.\n\n\nI want to know why St. Valentine got a holiday but St. Louis just got a crappy city.\n\n\nAnimals don’t have holidays.  They just go about their business from one day to the next and sometimes I think they’re happier for it.  I bet they’d be pissed though, if they knew they were missing out on so many presents.\n\nI’ve got a tattoo of a heart.  It was supposed to be a scarlet “A,” but the guy messed it up so I had him make it into a heart.  It was that or a red tepee.\n\nLove is evil spelled backwards to a dude that doesn’t know how to spell.\n\nSometimes I wonder what would have happened if blue was the color of love.  Lots of romantic skies, I guess.\n\nValentine was the name of a girl I dated in the early Seventies.  Everyone called her Val, but I called her Lenny.  I dumped her the first week of February because I knew that one day the next week, everything was going to be about her.  People should only get one day that’s “their day” and that should be their birthday.\n\nI’d say that my perfect Valentine’s Day would be me, a special lady, a bottle of red wine, a steak dinner, two heart-shaped cupcakes, a box of high-quality prophylactics, and that special lady’s credit card so I can go buy two more bottles of wine after she falls asleep.\n\nAnimals don’t have holidays.  They just go about their business from one day to the next and sometimes I think they’re happier for it.  I bet they’d be pissed though, if they knew they were missing out on so many presents.\n\n\nI’ve got a tattoo of a heart.  It was supposed to be a scarlet “A,” but the guy messed it up so I had him make it into a heart.  It was that or a red tepee.\n\n\nLove is evil spelled backwards to a dude that doesn’t know how to spell.\n\n\nSometimes I wonder what would have happened if blue was the color of love.  Lots of romantic skies, I guess.\n\n\nValentine was the name of a girl I dated in the early Seventies.  Everyone called her Val, but I called her Lenny.  I dumped her the first week of February because I knew that one day the next week, everything was going to be about her.  People should only get one day that’s “their day” and that should be their birthday.\n\n\nI’d say that my perfect Valentine’s Day would be me, a special lady, a bottle of red wine, a steak dinner, two heart-shaped cupcakes, a box of high-quality prophylactics, and that special lady’s credit card so I can go buy two more bottles of wine after she falls asleep."
  },
  {
    "date": { "date": "February 07", "time": "01:23 PM" },
    "content": "I know I told you that I don’t vote, but it looked like it might be a good place to meet some foxes so I decided to vote on Tuesday.  Seven times.  Twice in New Jersey, once in New York, and four times in Connecticut.  That’s the beauty of being able to make your own driver’s licenses.  That machine really opens a lot of doors for me, politically and otherwise.  I didn’t meet any broads but I did find a really great burger over in Newark.  It made the whole trip worth it.\n\nI know I told you that I don’t vote, but it looked like it might be a good place to meet some foxes so I decided to vote on Tuesday.  Seven times.  Twice in New Jersey, once in New York, and four times in Connecticut.  That’s the beauty of being able to make your own driver’s licenses.  That machine really opens a lot of doors for me, politically and otherwise.  I didn’t meet any broads but I did find a really great burger over in Newark.  It made the whole trip worth it.\n\nI say a lot of things that may turn out to be a little inaccurate sometimes.  It’s called being a person.  A lot of people in my life try to trip me up and say “But Creed you said the exactly opposite thing last week.”  Oh yeah?  Well, maybe I did and maybe I didn’t, hotshot.  Maybe you don’t hear things well.  Maybe I just changed my mind.  Who are you to tell me I’m a liar?  You’re the liar!  You’re the stupid liar, Liar!  Don’t you look at me like that.  Don’t you dare.  I will take your eyes and turn them into eyeball stew.  You hear me?  \n\nSorry.  I get emotional sometimes.  It’s just a part of who I am.  I’m a bird of many colors, like a toucan or something.  You know what else is a part of who I am?  GERD.  That’s right.  Gastroesophageal Reflux Disease.  It’s a serious problem in the world today.  You might know it as acid reflux.  I know it as the painful heartburn I experience almost every damn day.  I hate it so much.  When it happens, I want to rip out my throat.  I talked to a doctor friend I know and he told me it’ll go away if I stop eating spicy foods, tomatoes, and chocolate.  Then he said I had to stop drinking coffee.  I just about gut-punched him for saying that.  If I took out coffee, tomatoes, spicy foods, and chocolate, I’d be starving every day.  The good news is I don’t have to take his advice because he’s not really a doctor, he just knows a doctor.  I guess that makes him a doctor’s friend friend, not a doctor friend.  \n\nI say a lot of things that may turn out to be a little inaccurate sometimes.  It’s called being a person.  A lot of people in my life try to trip me up and say “But Creed you said the exactly opposite thing last week.”  Oh yeah?  Well, maybe I did and maybe I didn’t, hotshot.  Maybe you don’t hear things well.  Maybe I just changed my mind.  Who are you to tell me I’m a liar?  You’re the liar!  You’re the stupid liar, Liar!  Don’t you look at me like that.  Don’t you dare.  I will take your eyes and turn them into eyeball stew.  You hear me?  \n\n\nSorry.  I get emotional sometimes.  It’s just a part of who I am.  I’m a bird of many colors, like a toucan or something.  You know what else is a part of who I am?  GERD.  That’s right.  Gastroesophageal Reflux Disease.  It’s a serious problem in the world today.  You might know it as acid reflux.  I know it as the painful heartburn I experience almost every damn day.  I hate it so much.  When it happens, I want to rip out my throat.  I talked to a doctor friend I know and he told me it’ll go away if I stop eating spicy foods, tomatoes, and chocolate.  Then he said I had to stop drinking coffee.  I just about gut-punched him for saying that.  If I took out coffee, tomatoes, spicy foods, and chocolate, I’d be starving every day.  The good news is I don’t have to take his advice because he’s not really a doctor, he just knows a doctor.  I guess that makes him a doctor’s friend friend, not a doctor friend.  "
  },
  {
    "date": { "date": "January 31", "time": "12:24 PM" },
    "content": "Being in a band is the greatest, especially if you’re into smoke machines.  You’ve got to be careful about who you put in your band, though, because if you get the wrong combination of rockers, you could be in for a lifetime of pain.  I made a little guide to help you out when you’re choosing band members.\nGuitarists\nThese guys are the toughest to pick.  If you’re a guitar player yourself, consider yourself lucky that you don’t need to find one because these dudes have the biggest egos.  They’re the ones who want to be front and center all the time.  They’re the first ones buying the leather pants and they’re the ones spitting whiskey fireballs at everyone after shows.  When you’re finding a guitarist, look for one that says stuff like “Maybe the drummer should be the singer,” or “Sometimes I like to play with my back to the audience because I don’t really like attention.”  Trust me, he’s going to work out a lot better than picking the guy that says he wants to dress up like a sexy astronaut at every gig.\n\n\nBeing in a band is the greatest, especially if you’re into smoke machines.  You’ve got to be careful about who you put in your band, though, because if you get the wrong combination of rockers, you could be in for a lifetime of pain.  I made a little guide to help you out when you’re choosing band members.\n\nGuitarists\nThese guys are the toughest to pick.  If you’re a guitar player yourself, consider yourself lucky that you don’t need to find one because these dudes have the biggest egos.  They’re the ones who want to be front and center all the time.  They’re the first ones buying the leather pants and they’re the ones spitting whiskey fireballs at everyone after shows.  When you’re finding a guitarist, look for one that says stuff like “Maybe the drummer should be the singer,” or “Sometimes I like to play with my back to the audience because I don’t really like attention.”  Trust me, he’s going to work out a lot better than picking the guy that says he wants to dress up like a sexy astronaut at every gig.\n\n\nBass Players\nYou want your bass player to be the coolest guy on the stage and the quietest.  If it were up to me, kids who were taught to play the bass wouldn’t be allowed to speak for the rest of their lives.  There’s something calming a bass player who slaps out the notes without a word.  You know why I’m so against bass players speaking?  They’re the first guy to steal your lady and the first guy to rat you out to the cops to save their own hides.  I know this from experience.  They should also be expert head-nodders, as this is a major part of playing the bass.\nDrummers\nWhen you’re looking for a drummer, you want crazy but not too crazy.  You want a beat-keeper that’s going to pull up foxy lady’s skirts with his drumsticks when he passes by, but you don’t want someone that’s going to hit you in the face with those sticks if you tell him he needs some gum.  Once in a while you’ll find a drummer who embodies everything that is rock and rock, but most of the time those guys flame out real fast (I miss you, Moonie).  Bottom line: make sure whomever you pick can count to four and hold his liquor.\nKeyboardists\nIf you put a keyboardist in your band, I will personally kick your ass no matter how old I am.  A dude that plays the organ is a different story, but I don’t even have time to tell you to find someone like that.  It would take hours.\nHorns Section\nYou don’t need them, but for some reason, these guys will always buy the beer.  I think they’re just glad they’re not in marching band anymore.\nIf you follow my advice, you’re going to wind up with one hell of a band.  Just make sure you have a killer name, too, or you can just give up before you start.\n\nBass Players\nYou want your bass player to be the coolest guy on the stage and the quietest.  If it were up to me, kids who were taught to play the bass wouldn’t be allowed to speak for the rest of their lives.  There’s something calming a bass player who slaps out the notes without a word.  You know why I’m so against bass players speaking?  They’re the first guy to steal your lady and the first guy to rat you out to the cops to save their own hides.  I know this from experience.  They should also be expert head-nodders, as this is a major part of playing the bass.\n\nDrummers\nWhen you’re looking for a drummer, you want crazy but not too crazy.  You want a beat-keeper that’s going to pull up foxy lady’s skirts with his drumsticks when he passes by, but you don’t want someone that’s going to hit you in the face with those sticks if you tell him he needs some gum.  Once in a while you’ll find a drummer who embodies everything that is rock and rock, but most of the time those guys flame out real fast (I miss you, Moonie).  Bottom line: make sure whomever you pick can count to four and hold his liquor.\n\nKeyboardists\nIf you put a keyboardist in your band, I will personally kick your ass no matter how old I am.  A dude that plays the organ is a different story, but I don’t even have time to tell you to find someone like that.  It would take hours.\n\nHorns Section\nYou don’t need them, but for some reason, these guys will always buy the beer.  I think they’re just glad they’re not in marching band anymore.\n\nIf you follow my advice, you’re going to wind up with one hell of a band.  Just make sure you have a killer name, too, or you can just give up before you start."
  },
  {
    "date": { "date": "January 24", "time": "12:33 PM" },
    "content": "I saw that Willy Wonka movie last weekend and I didn’t care for it one bit.  For one thing, that boat scene triggered a flashback that took a full day to get out of.  Also, I don’t like the message it sends to kids.  Chocolate should be eaten because it’s delicious, not because you want to see the place where the chocolate is made.  I’ve been to chocolate factories before and they’re okay, but they’re really nothing special.  They’ve got a tasty smell but that’s about it.  If you’re looking for a contest with a real prize, play the lottery.  \nAlso, some things in that flick just didn’t add up.  First of all, if I was in that crowd when the little kid found the golden ticket, there’s no way I’m letting him get home with it.  I may not be as fast as I used to be, but that kid couldn’t have been more than eleven or twelve years old.  I’d just trip him, snag the ticket, and that would be the end of it.  Goodbye sissy kid, hello free trip to chocolate paradise.\n\nI saw that Willy Wonka movie last weekend and I didn’t care for it one bit.  For one thing, that boat scene triggered a flashback that took a full day to get out of.  Also, I don’t like the message it sends to kids.  Chocolate should be eaten because it’s delicious, not because you want to see the place where the chocolate is made.  I’ve been to chocolate factories before and they’re okay, but they’re really nothing special.  They’ve got a tasty smell but that’s about it.  If you’re looking for a contest with a real prize, play the lottery.  \n\nAlso, some things in that flick just didn’t add up.  First of all, if I was in that crowd when the little kid found the golden ticket, there’s no way I’m letting him get home with it.  I may not be as fast as I used to be, but that kid couldn’t have been more than eleven or twelve years old.  I’d just trip him, snag the ticket, and that would be the end of it.  Goodbye sissy kid, hello free trip to chocolate paradise.\n\nSecond, there’s no gum in the world that’s going to turn you into a blueberry and if there were, you couldn’t just be juiced to get you back to normal.  You’d have to go through some pretty extensive surgery and I doubt your insurance would cover it.  Mine barely covers my medicated foot cream, which brings me to my next point.  Old people can’t sleep head to toe like that because we’ve got enough fungus on out feet to knock out elephants.  Trust me.  The bottom of my foot could be used as a biological weapon.  \nI don’t trust people who say my name too many times when they’re talking to me.  “You know what I mean, Creed?”  “Well, Creed, I thought I’d never see you again.”  “Creed, you’re under arrest, Creed.”  What an obnoxious habit.  It’s not my real name anyway, so don’t waste your breath, you know?\nWent to a bathroom that had green-apple scented soap the other day.  It smelled so good it made me want to eat my hands.\n\nSecond, there’s no gum in the world that’s going to turn you into a blueberry and if there were, you couldn’t just be juiced to get you back to normal.  You’d have to go through some pretty extensive surgery and I doubt your insurance would cover it.  Mine barely covers my medicated foot cream, which brings me to my next point.  Old people can’t sleep head to toe like that because we’ve got enough fungus on out feet to knock out elephants.  Trust me.  The bottom of my foot could be used as a biological weapon.  \n\nI don’t trust people who say my name too many times when they’re talking to me.  “You know what I mean, Creed?”  “Well, Creed, I thought I’d never see you again.”  “Creed, you’re under arrest, Creed.”  What an obnoxious habit.  It’s not my real name anyway, so don’t waste your breath, you know?\n\nWent to a bathroom that had green-apple scented soap the other day.  It smelled so good it made me want to eat my hands."
  },
  {
    "date": { "date": "January 17", "time": "12:36 PM" },
    "content": "I don’t usually title these buggers, but today I’m going to.  I’m calling it “What I Look for in a President” because I keep hearing all kinds of buzzing about Presidents and elections and blacks and ladies and Mormons and short guys.  I don’t follow the news, but I use newspapers for lots of other purposes so it kind of just soaks in.\n\n\nI’ve been through lots of Presidents in my time and after a while, you get a sense of what you want in a leader.  Here’s my list of what I look for in a President:\n\n1.\tI want a President who likes to dance.  You get a square up there and none of the other countries want to party.  The key to international relations is dancing.\n\n2.\tMy President needs to get pissed.  Too many of those stiffs get to the White House and glad-hand everyone.  Somebody does something terrible to America, they sit there calmly in their football-shaped office and tell us that everything is going to be okay.  I want a dude (or dudette) who grabs a golf club and smashes things when they talk to the nation.  I want a leader who’s not afraid to tell everyone to go to hell.\n\n3.\tI want a President that looks good dressed up.  Nice cheeks bones are an added bonus.\n\n4.\tIf they’re going to make bad decisions, they better make up for them spectacularly.  I’m talking personalized apology notes, public floggings, and free ice cream.  If they want to sit in a dunk tank, I’ll be the first in line to take a shot.  \n\n5.\tI want at least three controversies, none of which make America look bad.  The President getting caught with an unbelievably foxy hooker is okay, but the President getting caught hitting the foxy hooker is not.  Selling weapons to Europe is fine, but selling weapons to Asia is not.  I’ll also accept some kind of unintentional foreign insult controversy, but it has to be funny and not boring.\n\n\nLook, it’s not like I vote or anything.  I’m just sharing my guidelines for good leadership.  You should probably figure out what you look for in a President on your own because it’s good for democracy blah blah blah.  Hopefully next November, if I’m still in America, whoever gets voted in will hit all five of my criteria.  If not, I can always move to Saskatchewan.  I hear Regina’s nice."
  },
  {
    "date": { "date": "January 10", "time": "03:25 PM" },
    "content": "I want to say something about naps.  They’re great.  I can’t get enough of them.  I take as many naps as I possibly can – at home, at work, malls, public restrooms, adult movie theaters.  At work, there’s this closet downstairs that’s filled with really comfortable mops.  You bundle those mops together and you’ve got yourself an instant mattress.  Not only that, you also end up getting a pretty good cleaning, depending on how much you roll around when you sleep.  Most days I don’t even shower anymore because I know those mops will do the job for me.  Three or four times a day, I tell the redhead that I’m going to get a snack and then pop down to my closet for some shuteye.  Depending on how I feel, I’ll usually stay for thirty, forty minutes before heading back up.  I call them “closetiestas,” like the Spaniards do.\n\nSome people like a lot of pillows but I’m not one of them.  I like one pillow at the most.  Sometimes, I’ll toss the pillow away and just use a rolled up washcloth.  No need to be greedy about your head cushions, right?\n\nI want to say something about naps.  They’re great.  I can’t get enough of them.  I take as many naps as I possibly can – at home, at work, malls, public restrooms, adult movie theaters.  At work, there’s this closet downstairs that’s filled with really comfortable mops.  You bundle those mops together and you’ve got yourself an instant mattress.  Not only that, you also end up getting a pretty good cleaning, depending on how much you roll around when you sleep.  Most days I don’t even shower anymore because I know those mops will do the job for me.  Three or four times a day, I tell the redhead that I’m going to get a snack and then pop down to my closet for some shuteye.  Depending on how I feel, I’ll usually stay for thirty, forty minutes before heading back up.  I call them “closetiestas,” like the Spaniards do.\n\n\nSome people like a lot of pillows but I’m not one of them.  I like one pillow at the most.  Sometimes, I’ll toss the pillow away and just use a rolled up washcloth.  No need to be greedy about your head cushions, right?\n\nI’ve seen those memory-foam mattress commercials for years and always wanted one (the mattress, not the commercial).  A few months ago, I sent away for the free sample they always offer.  When it showed up, I have to say, I was impressed.  They send you a little four inch by four inch square of the stuff and right away I could tell how comfortable it would be if I had the full mattress.  So I did what any smart person would do.  I made up four hundred fake names and now I’m just waiting for the rest of my free samples to arrive.  When they get here, I’m going to tape them all together and have a memory-foam mattress for free.  Take that, suckers!\n\nI’m not into counting sheep to fall asleep.  I count shots of bourbon.  I can usually get to eleven before I’m out like a light.  I’ll bet sheep like bourbon, too.  You can see it in their cold, black eyes.  Those dudes are drinkers.\n\n\n\n\nI’ve seen those memory-foam mattress commercials for years and always wanted one (the mattress, not the commercial).  A few months ago, I sent away for the free sample they always offer.  When it showed up, I have to say, I was impressed.  They send you a little four inch by four inch square of the stuff and right away I could tell how comfortable it would be if I had the full mattress.  So I did what any smart person would do.  I made up four hundred fake names and now I’m just waiting for the rest of my free samples to arrive.  When they get here, I’m going to tape them all together and have a memory-foam mattress for free.  Take that, suckers!\n\n\nI’m not into counting sheep to fall asleep.  I count shots of bourbon.  I can usually get to eleven before I’m out like a light.  I’ll bet sheep like bourbon, too.  You can see it in their cold, black eyes.  Those dudes are drinkers.\n\n\n\n\n"
  },
  {
    "date": { "date": "January 03", "time": "12:38 PM" },
    "content": "This is the year I’m finally going to tack on those extra fifteen pounds.  I’ve been skinny since birth (2 lbs. 8 oz.) and every year I tell myself that this is going to be my big year for bulking up.  Well guess what, body?  THIS IS THE YEAR.  I’m going to get so fat. \n\nI better not become one of those dudes that get a fat belly and nothing else.  I hate those jerks.  From behind, they look like normal joes, but as soon as they turn around – bam! – how did that guy get pregnant?  Skinny legs and a fat tummy is no way to go through life, that’s for sure.  When I get fat, I want to be fat everywhere.  I want people to look at me and think “doughy.”  I want kids to puff out their cheeks at me and pretend there’s an earthquake every time I take a step.  I want to get so fat that I don’t even get fat-rolls when I sit down, I just get a blob.\n\nThis is the year I’m finally going to tack on those extra fifteen pounds.  I’ve been skinny since birth (2 lbs. 8 oz.) and every year I tell myself that this is going to be my big year for bulking up.  Well guess what, body?  THIS IS THE YEAR.  I’m going to get so fat. \n\n\nI better not become one of those dudes that get a fat belly and nothing else.  I hate those jerks.  From behind, they look like normal joes, but as soon as they turn around – bam! – how did that guy get pregnant?  Skinny legs and a fat tummy is no way to go through life, that’s for sure.  When I get fat, I want to be fat everywhere.  I want people to look at me and think “doughy.”  I want kids to puff out their cheeks at me and pretend there’s an earthquake every time I take a step.  I want to get so fat that I don’t even get fat-rolls when I sit down, I just get a blob.\n\nIn order to gain the most weight possible, I’ve set up a very strict regimen for myself.  I’m going to park as close to places as possible so I don’t have to walk.  If there aren’t any spaces available, I’ll just wait in my car and eat a candy bar until somebody comes out.  When I go to the grocery store, I’m going to get one of those electric carts to zoom around in so I’m not burning calories as I’m buying calories.  I will never, ever take the stairs.  As for eating, I’m going for quantity over quality. Do I want cheese on my fries?  Yes.  Do I want to mega-size something?  Always. Will I finish food left behind by people at other tables?  I’ve been doing that my whole life.\n\nBy summertime, you’re going to see me on a beach and tell me to put my shirt on.  There’s going to be a whole new Creed around these parts and this guy’s breaking every chair he sits in.  Say goodbye to the skinny old guy you once knew, because here comes Chubby Creed and I’m going to eat your lunch.\n\nWish me luck.  \n\n\nIn order to gain the most weight possible, I’ve set up a very strict regimen for myself.  I’m going to park as close to places as possible so I don’t have to walk.  If there aren’t any spaces available, I’ll just wait in my car and eat a candy bar until somebody comes out.  When I go to the grocery store, I’m going to get one of those electric carts to zoom around in so I’m not burning calories as I’m buying calories.  I will never, ever take the stairs.  As for eating, I’m going for quantity over quality. Do I want cheese on my fries?  Yes.  Do I want to mega-size something?  Always. Will I finish food left behind by people at other tables?  I’ve been doing that my whole life.\n\n\nBy summertime, you’re going to see me on a beach and tell me to put my shirt on.  There’s going to be a whole new Creed around these parts and this guy’s breaking every chair he sits in.  Say goodbye to the skinny old guy you once knew, because here comes Chubby Creed and I’m going to eat your lunch.\n\n\nWish me luck.  \n"
  },
  {
    "date": { "date": "December 20", "time": "02:03 PM" },
    "content": "I’ve practiced a lot of religions over the years and of all of them, my favorite is still the Fraternal Order of Eternal Christmas.  It was a fairly small group that I helped put together in ’83 just outside of Lincoln, Nebraska.   The basic tenet was that, for us, Christmas was every single day.  We’d wake up every morning and open presents, then we’d all sit around and have a delicious group lunch.  At night, we’d have Christmas Eve dinner with goose and stuffing and then we’d go to bed, waiting for the whole thing to happen all over again.  I came up with this groovy creation story about Santa being a real man that arose from an elven tribe living among the polar ice caps.  People really seemed to dig it.  We got about thirty or forty followers before we got shut down by the State of Nebraska.  Apparently, people were doing a lot of stealing to keep the religion going financially.\n\nI’ve practiced a lot of religions over the years and of all of them, my favorite is still the Fraternal Order of Eternal Christmas.  It was a fairly small group that I helped put together in ’83 just outside of Lincoln, Nebraska.   The basic tenet was that, for us, Christmas was every single day.  We’d wake up every morning and open presents, then we’d all sit around and have a delicious group lunch.  At night, we’d have Christmas Eve dinner with goose and stuffing and then we’d go to bed, waiting for the whole thing to happen all over again.  I came up with this groovy creation story about Santa being a real man that arose from an elven tribe living among the polar ice caps.  People really seemed to dig it.  We got about thirty or forty followers before we got shut down by the State of Nebraska.  Apparently, people were doing a lot of stealing to keep the religion going financially.\n\nThis is going to come as a shock to all of you, so find yourself a recliner and park your caboose in it because here we go:  I love Christmas decorations.  I do.  Lights, mangers, inflatable Santas – you name it, I love it.  They remind me of some really great trips I took back in the day.\n\nYou know what I found out?  Menorahs make great weapons.  Just swap out the candles with razor blades and you’re good to go.\n\nIf you can’t afford a Christmas turkey from the supermarket, just bag yourself a free Canadian Goose.  They’re all over the place and taste very festive.\n\nDuring the holidays, I like to go to the mall dressed as Santa.  You’d be surprised how much free food you get when you’re in costume.  Last year I got in a fight with the “real” mall Santa and I kicked his ass back to the North Pole, which, for him, was somewhere out by Altoona.  Took a lot of pictures with kids that day and I made a bunch of moola, too.\n\nListen up, people: I’m going on a little holiday “vacation,” so I don’t know when I’ll next be in front of the old com-pu-ta-dor.  Hopefully Customs won’t be too much of a problem this time and I’ll be back in no time with a new balloon collection.  Good tidings to all and to all a good fight.\n\nThis is going to come as a shock to all of you, so find yourself a recliner and park your caboose in it because here we go:  I love Christmas decorations.  I do.  Lights, mangers, inflatable Santas – you name it, I love it.  They remind me of some really great trips I took back in the day.\n\n\nYou know what I found out?  Menorahs make great weapons.  Just swap out the candles with razor blades and you’re good to go.\n\n\nIf you can’t afford a Christmas turkey from the supermarket, just bag yourself a free Canadian Goose.  They’re all over the place and taste very festive.\n\n\nDuring the holidays, I like to go to the mall dressed as Santa.  You’d be surprised how much free food you get when you’re in costume.  Last year I got in a fight with the “real” mall Santa and I kicked his ass back to the North Pole, which, for him, was somewhere out by Altoona.  Took a lot of pictures with kids that day and I made a bunch of moola, too.\n\n\nListen up, people: I’m going on a little holiday “vacation,” so I don’t know when I’ll next be in front of the old com-pu-ta-dor.  Hopefully Customs won’t be too much of a problem this time and I’ll be back in no time with a new balloon collection.  Good tidings to all and to all a good fight."
  },
  {
    "date": { "date": "December 13", "time": "02:12 PM" },
    "content": "Man, the holidays really bum me out.  Nobody makes me ham.  Nobody bakes me cookies.  Nobody buys me presents.  I guess it has a lot to do with the fact that I’m not allowed to talk to my family anymore since the fire incident.  Before you get all up in arms, let me set the record straight – I didn’t set a fire.  I merely took everyone’s presents and threw them into the fireplace when they wouldn’t let me open one of mine early.  No big deal, right?  One present.  That’s all I wanted to open.  But no, my family has “rules” and “traditions.”  Hogwash.  Those squares always overreacted to everything anyway.  Who needs ‘em?  Not me.  I still like presents though, even though I don’t usually get any.  That’s why I put together a Holiday Wish List every year.  Now that I’m a Syber-World Astronaut, I thought I’d put my HWL (Holiday Wish List) up on the Internets. \n\nMan, the holidays really bum me out.  Nobody makes me ham.  Nobody bakes me cookies.  Nobody buys me presents.  I guess it has a lot to do with the fact that I’m not allowed to talk to my family anymore since the fire incident.  Before you get all up in arms, let me set the record straight – I didn’t set a fire.  I merely took everyone’s presents and threw them into the fireplace when they wouldn’t let me open one of mine early.  No big deal, right?  One present.  That’s all I wanted to open.  But no, my family has “rules” and “traditions.”  Hogwash.  Those squares always overreacted to everything anyway.  Who needs ‘em?  Not me.  I still like presents though, even though I don’t usually get any.  That’s why I put together a Holiday Wish List every year.  Now that I’m a Syber-World Astronaut, I thought I’d put my HWL (Holiday Wish List) up on the Internets. \n\nMy Holiday Wish List 2007\n•\tA really sharp knife.  I want one that cuts cans and opens doors.\n•\tThree hundred dollars in unmarked singles.  I owe a guy.\n•\tOne of those Russian fur hats that they wear in the Kremlin.\n•\tWhale blubber.  Don’t question me.\n•\tA Nintendo Wii with additional nunchuk controller and Mario Party 8.\n•\tA collection of discarded teeth with all necessary tools to make a necklace.\n•\tAlpacas.  Lots of ‘em.\n•\tMy weight in gold-covered chocolate coins.\n•\tAn Eye Phone, but keep in mind that I wear glasses sometimes.\n•\t1971, retold to me by a broad with a real sweet voice.\nIf you want to make this the best Christmas ever, go ahead and get me any of the things on this list.  I’ll love you forever.  Drop them off to me at work, but don’t put them in the “Toys for Tots” bins – those are just for my co-workers to use for my gifts.  I wish they’d stop giving me dolls, though.  I have more than enough already.\n\n\nMy Holiday Wish List 2007\n\n•\tA really sharp knife.  I want one that cuts cans and opens doors.\n\n•\tThree hundred dollars in unmarked singles.  I owe a guy.\n\n•\tOne of those Russian fur hats that they wear in the Kremlin.\n\n•\tWhale blubber.  Don’t question me.\n\n•\tA Nintendo Wii with additional nunchuk controller and Mario Party 8.\n\n•\tA collection of discarded teeth with all necessary tools to make a necklace.\n\n•\tAlpacas.  Lots of ‘em.\n\n•\tMy weight in gold-covered chocolate coins.\n\n•\tAn Eye Phone, but keep in mind that I wear glasses sometimes.\n\n•\t1971, retold to me by a broad with a real sweet voice.\n\nIf you want to make this the best Christmas ever, go ahead and get me any of the things on this list.  I’ll love you forever.  Drop them off to me at work, but don’t put them in the “Toys for Tots” bins – those are just for my co-workers to use for my gifts.  I wish they’d stop giving me dolls, though.  I have more than enough already.\n"
  },
  {
    "date": { "date": "December 06", "time": "01:42 PM" },
    "content": "With the exception of brawling, I haven’t been much of a sports fan for a long time now.  That all changed on Monday night after work.  I was hanging out near that new Xavier Center by Scranton Prep looking for scrap building materials (the darkness gives me a better shot at scoring some of that sweet, sweet copper).  After a few minutes, I started hearing all kinds of hooting and hollering coming from inside, so I wandered over to investigate.  For a second, I hoped it was going to be a piñata festival.  I had a dream once about being in the middle of a piñata festival and I’ve been waiting for it to come true.  Lord knows I love hard candy.\n\nSadly, it wasn’t a piñata festival.  I can’t say I was surprised though.  I’ve been hoping for it for so long that I don’t even get disappointed anymore.  I just accept the fact that one day, when I least expect it, I’m going to walk into a giant auditorium and people are going to be popping colorful papier-mâché burros and swimming in delicious hard candy. \n\n\nWith the exception of brawling, I haven’t been much of a sports fan for a long time now.  That all changed on Monday night after work.  I was hanging out near that new Xavier Center by Scranton Prep looking for scrap building materials (the darkness gives me a better shot at scoring some of that sweet, sweet copper).  After a few minutes, I started hearing all kinds of hooting and hollering coming from inside, so I wandered over to investigate.  For a second, I hoped it was going to be a piñata festival.  I had a dream once about being in the middle of a piñata festival and I’ve been waiting for it to come true.  Lord knows I love hard candy.\n\n\nSadly, it wasn’t a piñata festival.  I can’t say I was surprised though.  I’ve been hoping for it for so long that I don’t even get disappointed anymore.  I just accept the fact that one day, when I least expect it, I’m going to walk into a giant auditorium and people are going to be popping colorful papier-mâché burros and swimming in delicious hard candy. \n\n\nInstead of a piñata festival, I found a varsity girls’ basketball game.  I almost walked right out, but the game drew me in like a tractor beam.  I was hooked right away.  Those elegant ladies were taking the game back to its fundamentals without any of the flash or razzle-dazzle that the boys play with these days.  It was a thing of beauty.  Every pass, every shot, every dribble – I felt like I was watching a symphony: A symphony of overly tall girls making the most of their awkward height. \n\nI stayed for the entire game.  When it was all over, I was so fired up that I got in the high-five line with both teams.  Some of the spectators thought it was strange, but most everyone thought I was somebody’s senile grandfather so they just smiled and laughed.  You’d be amazed at the things I can do because people assume I’m senile, but the joke’s on them because I’m nowhere close to senile yet. \n\nThat one game showed me that grace and style and raw emotion have not disappeared from the sporting world.  If you ask me, high school girls’ basketball is where it’s at. \n\n\nInstead of a piñata festival, I found a varsity girls’ basketball game.  I almost walked right out, but the game drew me in like a tractor beam.  I was hooked right away.  Those elegant ladies were taking the game back to its fundamentals without any of the flash or razzle-dazzle that the boys play with these days.  It was a thing of beauty.  Every pass, every shot, every dribble – I felt like I was watching a symphony: A symphony of overly tall girls making the most of their awkward height. \n\n\nI stayed for the entire game.  When it was all over, I was so fired up that I got in the high-five line with both teams.  Some of the spectators thought it was strange, but most everyone thought I was somebody’s senile grandfather so they just smiled and laughed.  You’d be amazed at the things I can do because people assume I’m senile, but the joke’s on them because I’m nowhere close to senile yet. \n\n\nThat one game showed me that grace and style and raw emotion have not disappeared from the sporting world.  If you ask me, high school girls’ basketball is where it’s at. \n"
  },
  {
    "date": { "date": "November 29", "time": "12:21 PM" },
    "content": "They say the Friday after Thanksgiving is the biggest shopping day of the year.  Not for the old Creedster.  For me, Black Friday’s when I work out all my problems.  I don’t need to waste my cash on fancy “therapists” or “court-appointed analysts.”  Instead, I just suit up and get ready for battle.  That’s how I celebrate the fourth Friday of every November.\n\nThis year, I didn’t even go to sleep after Thanksgiving.  I was so jazzed up from the massive portion of cranberry sauce that I couldn’t stop pacing.  At around 2:30am, I decided it was time to start getting ready.  I wrapped my body in newspapers and Black Friday ads until I had a good enough base to know I’d be okay if anybody had a shiv.  Then I started gathering my weapons.  Instead of brass knuckles (which I always lose), I found these really sharp plastic spider rings that were leftover from Halloween.  For poking and tripping, I grabbed a cane from one of the geezers at the soup kitchen.  [SIDE NOTE: People underestimate the value of old man weapons.  I’m allowed to walk around with a cane anywhere I damn well please and that cane comes in handy, let me tell you.  It’s just one of those social conventions that works in favor of the elderly – same goes for early bird senior specials at restaurants.]\n\nThey say the Friday after Thanksgiving is the biggest shopping day of the year.  Not for the old Creedster.  For me, Black Friday’s when I work out all my problems.  I don’t need to waste my cash on fancy “therapists” or “court-appointed analysts.”  Instead, I just suit up and get ready for battle.  That’s how I celebrate the fourth Friday of every November.\n\n\nThis year, I didn’t even go to sleep after Thanksgiving.  I was so jazzed up from the massive portion of cranberry sauce that I couldn’t stop pacing.  At around 2:30am, I decided it was time to start getting ready.  I wrapped my body in newspapers and Black Friday ads until I had a good enough base to know I’d be okay if anybody had a shiv.  Then I started gathering my weapons.  Instead of brass knuckles (which I always lose), I found these really sharp plastic spider rings that were leftover from Halloween.  For poking and tripping, I grabbed a cane from one of the geezers at the soup kitchen.  [SIDE NOTE: People underestimate the value of old man weapons.  I’m allowed to walk around with a cane anywhere I damn well please and that cane comes in handy, let me tell you.  It’s just one of those social conventions that works in favor of the elderly – same goes for early bird senior specials at restaurants.]\n\nSo after I got myself ready, I headed over to the mall.  That place usually gets rocking at around five in the morning, so I made sure to be there by four to snag a good place in line.  I find the toy stores to be the center of the mayhem most years, so I headed there first.  All these parents were just foaming at the mouth to get their hands on the latest Cabbage Patch Elmo Pokey-Man Nintendos and I couldn’t wait to get in their way.  As soon as the doors opened, I started a stampede.  I’ve got old standbys that I yell out to really heat things up.  “They’ve only got three left!”  “Huge sale in Aisle Five!”  “That jerk is taking all of them!”  Nobody has any idea what I’m referring to, but they get all worked up nonetheless.  Almost right away, people started shoving and pushing and where was I?  Right in the middle of all the action.\n\nI started out by poking people with my cane and scratching them with my rings and pretty soon, I didn’t care so much about sales tax or cold weather or paternity suits – all the things that stick in my craw, really.  Nobody got seriously injured and all my bottled up feelings just disappeared, so it was a win-win for everyone, in my opinion.  \n\nOnce I finished at the toy store, I moved on to the electronics stores where I started over from scratch and instigated a whole new riot.  It felt great.  I’ll tell you what -- this is shaping up to be one of the best holiday/therapy seasons of all time.\n\n\n\nSo after I got myself ready, I headed over to the mall.  That place usually gets rocking at around five in the morning, so I made sure to be there by four to snag a good place in line.  I find the toy stores to be the center of the mayhem most years, so I headed there first.  All these parents were just foaming at the mouth to get their hands on the latest Cabbage Patch Elmo Pokey-Man Nintendos and I couldn’t wait to get in their way.  As soon as the doors opened, I started a stampede.  I’ve got old standbys that I yell out to really heat things up.  “They’ve only got three left!”  “Huge sale in Aisle Five!”  “That jerk is taking all of them!”  Nobody has any idea what I’m referring to, but they get all worked up nonetheless.  Almost right away, people started shoving and pushing and where was I?  Right in the middle of all the action.\n\n\nI started out by poking people with my cane and scratching them with my rings and pretty soon, I didn’t care so much about sales tax or cold weather or paternity suits – all the things that stick in my craw, really.  Nobody got seriously injured and all my bottled up feelings just disappeared, so it was a win-win for everyone, in my opinion.  \n\n\nOnce I finished at the toy store, I moved on to the electronics stores where I started over from scratch and instigated a whole new riot.  It felt great.  I’ll tell you what -- this is shaping up to be one of the best holiday/therapy seasons of all time.\n\n\n"
  },
  {
    "date": { "date": "November 22", "time": "01:30 PM" },
    "content": "Picked up a digital camera the other day, just in time for the holidays.  I hope the guy who owns it doesn’t miss it too much.\n\nI took my motorized scooter out for a little ride over the weekend.  Riding that thing in the cold November air makes me feel like a champion.  It’s tiny and red and helps me get ladies better than a puppy, which reminds me that I need to get a puppy.  I rode all over town and ended up with fifteen phone numbers.  One of the broads didn’t even have most of her teeth.  I’m going to call her first.\n\nPicked up a digital camera the other day, just in time for the holidays.  I hope the guy who owns it doesn’t miss it too much.\n\n\nI took my motorized scooter out for a little ride over the weekend.  Riding that thing in the cold November air makes me feel like a champion.  It’s tiny and red and helps me get ladies better than a puppy, which reminds me that I need to get a puppy.  I rode all over town and ended up with fifteen phone numbers.  One of the broads didn’t even have most of her teeth.  I’m going to call her first.\n\nI’ve been sick the past few days.  I guess it serves me right.  I just can’t say no to all of those free flu shots for seniors. \n\nThe main problem with being sick is that I feel like crap.  My body’s always either too hot or too cold and I keep on running to the bathroom to throw up.  I know what you’re saying: “Hey Creed, didn’t you pay for pills twenty years ago that made you do the exact same thing?”  Well the answer’s yes and I don’t appreciate your tone.  The fact of the matter is, I’ve sworn off pills altogether so I can’t even take aspirin to make this craziness go away.  You know how it starts—first I start taking two aspirin every four hours and then I’m taking four extra-strength aspirin every two hours and all of a sudden I’m taking six uppers with a chaser of three downers and I’m walking around the mall dressed like the Easter Raccoon.  It’s not pretty and parents really don’t appreciate it, no matter how nice you are to the kids.  I guess I’ll just have to ride this flu out until I get better.  Wish me luck.\n\nBig day down at the Soup Kitchen today.  I’m bringing my elbow pads because I got roughed up pretty bad last time.  Not this year.  I’m going to be first in line for that stuffing and God help the idiot that tries to get in my way.  Creed’s not going to be stuck with just candied carrots again, that’s for sure.  I’m going to get some of that bird.  You just watch me.\n\n\nI’ve been sick the past few days.  I guess it serves me right.  I just can’t say no to all of those free flu shots for seniors. \n\n\nThe main problem with being sick is that I feel like crap.  My body’s always either too hot or too cold and I keep on running to the bathroom to throw up.  I know what you’re saying: “Hey Creed, didn’t you pay for pills twenty years ago that made you do the exact same thing?”  Well the answer’s yes and I don’t appreciate your tone.  The fact of the matter is, I’ve sworn off pills altogether so I can’t even take aspirin to make this craziness go away.  You know how it starts—first I start taking two aspirin every four hours and then I’m taking four extra-strength aspirin every two hours and all of a sudden I’m taking six uppers with a chaser of three downers and I’m walking around the mall dressed like the Easter Raccoon.  It’s not pretty and parents really don’t appreciate it, no matter how nice you are to the kids.  I guess I’ll just have to ride this flu out until I get better.  Wish me luck.\n\n\nBig day down at the Soup Kitchen today.  I’m bringing my elbow pads because I got roughed up pretty bad last time.  Not this year.  I’m going to be first in line for that stuffing and God help the idiot that tries to get in my way.  Creed’s not going to be stuck with just candied carrots again, that’s for sure.  I’m going to get some of that bird.  You just watch me.\n"
  },
  {
    "date": { "date": "November 15", "time": "10:36 AM" },
    "content": "I lose my glasses all the time.  It drives me nuts.  I’ve tried all the gadgets – neck-straps, RecSpecs, etc. – but nothing seems to work.  So this week, I’m trying something new.  I’m going to take a little crazy glue and glue the bridge of my glasses to the bridge of my nose.  That way, I’ll never lose my glasses again.  Also, they won’t slip down my nose, which is my second biggest pet peeve about glasses.  When I want to take them off for my weekly shower, I’ll jump into the sauna at the JCC and the glue will just melt away.  It’s foolproof.  Once I’ve tested it out, I’m going to start selling Creed’s Spectacle Glue all over the country.  I’ll make thousands!\n\nSometimes I wear my glasses to look smart in front of ladies.  Other times, I wear them to see better when those ladies bend over.\n\n\nI lose my glasses all the time.  It drives me nuts.  I’ve tried all the gadgets – neck-straps, RecSpecs, etc. – but nothing seems to work.  So this week, I’m trying something new.  I’m going to take a little crazy glue and glue the bridge of my glasses to the bridge of my nose.  That way, I’ll never lose my glasses again.  Also, they won’t slip down my nose, which is my second biggest pet peeve about glasses.  When I want to take them off for my weekly shower, I’ll jump into the sauna at the JCC and the glue will just melt away.  It’s foolproof.  Once I’ve tested it out, I’m going to start selling Creed’s Spectacle Glue all over the country.  I’ll make thousands!\n\n\nSometimes I wear my glasses to look smart in front of ladies.  Other times, I wear them to see better when those ladies bend over.\n\n\nI don’t understand contact lenses.  Who wants to see perfectly all the time?  I wear glasses so I can see when I want to see, but when I just want to relax, I can take them off and enjoy the fuzzy.  Contacts are a ploy by the eye-care companies to sell you their made-up products like “solution.”  Did you ever buy “solution” before contacts were invented?  No way.  Same thing with “contact cases” and “tissues.”  They make you buy their new-fangled contact lenses and on top of that, you’re supposed to buy all of their accessories, too?  No thanks.  I might look like a sucker when I’m wearing my glasses, but at least I’m not a sucker at heart.\n\nWhat the hell happened to monocles?  That’s one fashion accessory that actually had a purpose.  Most eye doctors don’t tell you that only one eye is bad because they want to sell you the full pair of glasses.  Monocles are for smart people who had the wherewithal to ask if they really needed two lenses.  My Pop used to wear a monocle around the house when I was growing up, said it made him feel rich.  I love feeling rich, but I can’t find a damn monocle anywhere these days.  What’s this world coming to?\n\nI don’t understand contact lenses.  Who wants to see perfectly all the time?  I wear glasses so I can see when I want to see, but when I just want to relax, I can take them off and enjoy the fuzzy.  Contacts are a ploy by the eye-care companies to sell you their made-up products like “solution.”  Did you ever buy “solution” before contacts were invented?  No way.  Same thing with “contact cases” and “tissues.”  They make you buy their new-fangled contact lenses and on top of that, you’re supposed to buy all of their accessories, too?  No thanks.  I might look like a sucker when I’m wearing my glasses, but at least I’m not a sucker at heart.\n\n\nWhat the hell happened to monocles?  That’s one fashion accessory that actually had a purpose.  Most eye doctors don’t tell you that only one eye is bad because they want to sell you the full pair of glasses.  Monocles are for smart people who had the wherewithal to ask if they really needed two lenses.  My Pop used to wear a monocle around the house when I was growing up, said it made him feel rich.  I love feeling rich, but I can’t find a damn monocle anywhere these days.  What’s this world coming to?"
  },
  {
    "date": { "date": "November 08", "time": "09:45 AM" },
    "content": "I don’t know about all this green stuff.  I’m more of an indigo man myself.  I will tell you this, though: I’m all about recycling.  When I lived up in Maine for three years, recycling was my main job and the lessons that I’ve learned have stuck with me ever since.  Number one lesson: cans are not just cans.  They’re nickels, in can form.  You wouldn’t throw away a nickel, would you?  Not a chance.  So why do people throw away cans?  I have no idea.  What I do know is that I supported myself for a long time on those cans and I might even say that I owe my life to them.  If I wasn’t collecting cans, I can only imagine what I would have been collecting.  Probably infectious diseases.\n\nBottles and cans aren’t just free money for the opportunistic among us.  They also work as a great security system.  When I go to sleep at night, no matter where I am, I spread a circle of crushed cans and empty bottles around me.  That way, if anybody tries to mess with me or my stuff, I’ll hear those bastards coming.  I also use thumbtacks if I can afford them.\n\n\nI don’t know about all this green stuff.  I’m more of an indigo man myself.  I will tell you this, though: I’m all about recycling.  When I lived up in Maine for three years, recycling was my main job and the lessons that I’ve learned have stuck with me ever since.  Number one lesson: cans are not just cans.  They’re nickels, in can form.  You wouldn’t throw away a nickel, would you?  Not a chance.  So why do people throw away cans?  I have no idea.  What I do know is that I supported myself for a long time on those cans and I might even say that I owe my life to them.  If I wasn’t collecting cans, I can only imagine what I would have been collecting.  Probably infectious diseases.\n\n\nBottles and cans aren’t just free money for the opportunistic among us.  They also work as a great security system.  When I go to sleep at night, no matter where I am, I spread a circle of crushed cans and empty bottles around me.  That way, if anybody tries to mess with me or my stuff, I’ll hear those bastards coming.  I also use thumbtacks if I can afford them.\n\n\n\nAs far as I’m concerned, recycling starts with underpants.\n\nA few years back, I bought myself a tree in Israel.  I got a certificate and everything to prove it.  When I got kicked out of the halfway house a while ago, I decided I wanted to live in my Israeli tree.  Build a tree house or something.  So I made some calls and guess what I found out?  It’s a total scam!  They make it seem like you own the tree when you buy it, but when you actually want to claim your tree, they say it was just a donation.  I was on the phone with those tree people for eight hours arguing about who actually owns that stupid tree.  I’m no lawyer, but I’m pretty sure that a certificate is a legally binding document.  I’ll see those tree huggers/hoarders in court.\n\n\n\nAs far as I’m concerned, recycling starts with underpants.\n\n\nA few years back, I bought myself a tree in Israel.  I got a certificate and everything to prove it.  When I got kicked out of the halfway house a while ago, I decided I wanted to live in my Israeli tree.  Build a tree house or something.  So I made some calls and guess what I found out?  It’s a total scam!  They make it seem like you own the tree when you buy it, but when you actually want to claim your tree, they say it was just a donation.  I was on the phone with those tree people for eight hours arguing about who actually owns that stupid tree.  I’m no lawyer, but I’m pretty sure that a certificate is a legally binding document.  I’ll see those tree huggers/hoarders in court.\n"
  },
  {
    "date": { "date": "November 01", "time": "01:03 PM" },
    "content": "If anyone knows how to get chocolate out of hair, let me know.  I fell asleep on top of forty Fun Size Milky Ways last night and now I’ve got nougat everywhere.  I already tried peanut butter, but that just made my hair into a different kind of candy.  I’ll make you a deal: you get it out of my hair, you get to keep it.\n\nParents always freak out about crazy people giving their kids apples with razorblades hidden inside for Halloween.  Those parents are idiots.  If you’re getting a free razorblade inside your apple, you shouldn’t be complaining.   And if you really want to impress me on Halloween, give me some licorice.  That stuff hits the spot.\n\nIf anyone knows how to get chocolate out of hair, let me know.  I fell asleep on top of forty Fun Size Milky Ways last night and now I’ve got nougat everywhere.  I already tried peanut butter, but that just made my hair into a different kind of candy.  I’ll make you a deal: you get it out of my hair, you get to keep it.\n\n\nParents always freak out about crazy people giving their kids apples with razorblades hidden inside for Halloween.  Those parents are idiots.  If you’re getting a free razorblade inside your apple, you shouldn’t be complaining.   And if you really want to impress me on Halloween, give me some licorice.  That stuff hits the spot.\n\nI think I beat my Halloween candy record this year.  I’ve got six garbage bags full and that’s after I threw away all of the Smarties and hard candy.  Before you go all crazy saying “Creed’s too old to be trick-or-treating,” let me tell you something:  if you rat me out, I will come after you.  This is the only time of the year where I’m in a disguise and people give me candy.  Don’t ruin it.\n\nWhen I trick-or-treat, I always wear a full facemask so nobody knows how old I am.  This year I went as classic Montreal Canadiens hockey goalie Jacques Plante. You’re always good to go when you’re dressed as a famous former athlete.  People revere athletes.  They love giving them candy.  To further get around the age issue, I pretended I was a deaf-mute version of Jacques Plante so nobody could hear my voice.  That really made the difference.  I carried around a note to explain the whole thing.\n\n         Dear Person,\n         Happy Halloween.  I’m a deaf-mute, which is why I can’t say trick-or-treat.  I still want your \n         candy though, so please dump it in my bag.  You may want to give me double if you feel \n                   guilty about my disability.  \n                   Peace and love,\n                   Former Montreal Canadiens Hockey Goalie Jacques Plante\n\nOne guy thought I was actually Jacques Plante and he wouldn’t give me anything.  I guess he was a big Maple Leafs fan.\n\nI think I beat my Halloween candy record this year.  I’ve got six garbage bags full and that’s after I threw away all of the Smarties and hard candy.  Before you go all crazy saying “Creed’s too old to be trick-or-treating,” let me tell you something:  if you rat me out, I will come after you.  This is the only time of the year where I’m in a disguise and people give me candy.  Don’t ruin it.\n\n\nWhen I trick-or-treat, I always wear a full facemask so nobody knows how old I am.  This year I went as classic Montreal Canadiens hockey goalie Jacques Plante. You’re always good to go when you’re dressed as a famous former athlete.  People revere athletes.  They love giving them candy.  To further get around the age issue, I pretended I was a deaf-mute version of Jacques Plante so nobody could hear my voice.  That really made the difference.  I carried around a note to explain the whole thing.\n\n\n         Dear Person,\n\n         Happy Halloween.  I’m a deaf-mute, which is why I can’t say trick-or-treat.  I still want your \n         candy though, so please dump it in my bag.  You may want to give me double if you feel \n                   guilty about my disability.  \n\n                   Peace and love,\n                   Former Montreal Canadiens Hockey Goalie Jacques Plante\n\n\nOne guy thought I was actually Jacques Plante and he wouldn’t give me anything.  I guess he was a big Maple Leafs fan."
  },
  {
    "date": { "date": "October 25", "time": "02:05 PM" },
    "content": "I don’t know how, but I found myself at a concert on Saturday night.  I started out at Poor Richards with a few Long Islands, picked up some onion rings from the cafeteria over at Marywood, and out of nowhere I was grooving along to some tunes at Battle of the Bands.  It was the first time I’ve been to a concert since the turn of the century (this one) and it freaked me out.  \n\nDon’t get me wrong: I love music.  Music is the only thing I can really remember for at least half of my life and I couldn’t live without it.  Concerts, on the other hand, are like magnets for big dudes with hard fists.  I had to swear them off -- too many jagged bottle cuts will do that to you.  Concerts make me feel like a warrior and sometimes that’s not a good thing.  Especially in the eyes of the law.  \n\nI don’t know how, but I found myself at a concert on Saturday night.  I started out at Poor Richards with a few Long Islands, picked up some onion rings from the cafeteria over at Marywood, and out of nowhere I was grooving along to some tunes at Battle of the Bands.  It was the first time I’ve been to a concert since the turn of the century (this one) and it freaked me out.  \n\n\nDon’t get me wrong: I love music.  Music is the only thing I can really remember for at least half of my life and I couldn’t live without it.  Concerts, on the other hand, are like magnets for big dudes with hard fists.  I had to swear them off -- too many jagged bottle cuts will do that to you.  Concerts make me feel like a warrior and sometimes that’s not a good thing.  Especially in the eyes of the law.  \n\n\nThe only band I saw was called “Yule Eric and the Danielles” and they played rocked-out Christmas songs.  They sound like Deep Purple if Deep Purple ever cut a Christmas album.  There was this real hot number singing back-up – one of the Danielles – and I could have sworn she was the reincarnation of the girl I took to my prom, except this one wasn’t pregnant.  She had this whole Italian thing going on with a little bit of the princess from Aladdin thrown in for good measure.    Trust me, she was a fox and I don’t mean the animal kind, although she did have a fox-like nose.  I’d let her sing to me all night long, but I probably couldn’t afford it.  Chicks like that don’t sing for free. \n\nAt around eleven, the band started playing a metal version of “Silent Night” and the whole place got kind of rowdy.  Rowdy’s my specialty, so I jumped right in the middle of the pit and started bopping.  Next thing I know, there’s a kid on the floor with a busted nose and I’m being hauled out onto the street by the security guards.  Now I’m not one to complain, but that guy’s face really left a mark on my elbow.  I’m no spring chicken anymore and my elbow can only take so much trauma.  Spent some time on WebMD when I got home and it looks like I’ve got what they call menstrual cramps.  Anyway, I got a bruise that looks like Mama Cass and I never got that Danielle’s number.\n\nNow I wouldn’t say that my return to the concert scene was a bust, but it certainly could have gone better.  Next time I go, I’m just going to sit in the back, nod my head, and stay away from the roughnecks.  Also, I’m going to bring my brass knuckles.  That’ll show those punks.\n\n\n\n\nThe only band I saw was called “Yule Eric and the Danielles” and they played rocked-out Christmas songs.  They sound like Deep Purple if Deep Purple ever cut a Christmas album.  There was this real hot number singing back-up – one of the Danielles – and I could have sworn she was the reincarnation of the girl I took to my prom, except this one wasn’t pregnant.  She had this whole Italian thing going on with a little bit of the princess from Aladdin thrown in for good measure.    Trust me, she was a fox and I don’t mean the animal kind, although she did have a fox-like nose.  I’d let her sing to me all night long, but I probably couldn’t afford it.  Chicks like that don’t sing for free. \n\n\nAt around eleven, the band started playing a metal version of “Silent Night” and the whole place got kind of rowdy.  Rowdy’s my specialty, so I jumped right in the middle of the pit and started bopping.  Next thing I know, there’s a kid on the floor with a busted nose and I’m being hauled out onto the street by the security guards.  Now I’m not one to complain, but that guy’s face really left a mark on my elbow.  I’m no spring chicken anymore and my elbow can only take so much trauma.  Spent some time on WebMD when I got home and it looks like I’ve got what they call menstrual cramps.  Anyway, I got a bruise that looks like Mama Cass and I never got that Danielle’s number.\n\n\nNow I wouldn’t say that my return to the concert scene was a bust, but it certainly could have gone better.  Next time I go, I’m just going to sit in the back, nod my head, and stay away from the roughnecks.  Also, I’m going to bring my brass knuckles.  That’ll show those punks.\n\n\n"
  },
  {
    "date": { "date": "October 18", "time": "01:29 PM" },
    "content": "There’s been a lot of bad mojo going on at work lately because of computers.  Some kid’s been coming around saying how he wants to replace everyone with robots and calculators and little pieces of fruit.  The Bossman listens to him, too, even though the kid’s real scrawny and has a horse face.  Don’t get me wrong, I like computers as much as the next Joe, but when they start messing with me, I’m not just going to sit there and take it.  I’ve seen the movies.  If you want to fight back against a machine, you’ve got to chuck it in acid.\n\nAcid.  Oh man.  Just writing that word brings back some memories.  Not really memories.  Flashbacks.  Scary ones.  I get them all the time.  The other day I turned on the TV and everyone on the screen was a caveman.  Freaked my bean, man.\n\n\nThere’s been a lot of bad mojo going on at work lately because of computers.  Some kid’s been coming around saying how he wants to replace everyone with robots and calculators and little pieces of fruit.  The Bossman listens to him, too, even though the kid’s real scrawny and has a horse face.  Don’t get me wrong, I like computers as much as the next Joe, but when they start messing with me, I’m not just going to sit there and take it.  I’ve seen the movies.  If you want to fight back against a machine, you’ve got to chuck it in acid.\n\n\nAcid.  Oh man.  Just writing that word brings back some memories.  Not really memories.  Flashbacks.  Scary ones.  I get them all the time.  The other day I turned on the TV and everyone on the screen was a caveman.  Freaked my bean, man.\n\n\n\nMy favorite flashback of all time is when I see the black lab puppy I had when I was a kid.  Found him when I was walking back from the night shift at my warehouse job.  I must’ve been seven or eight at the time.  Named the pooch Bozo and let him sleep in my sock drawer when I wasn’t home.  My Ma found him one day and threatened to let the little guy loose, but I slipped her a ten spot and she got real quiet.  Bozo didn’t make it very far in the game of life, but I still see him about four, five times a year.  Even though I can’t pet him, I’m glad that he’s still around, if only in my drug-addled mind.\n\nDogs make good friends, but if you’re looking for a really dependable pal, you’ve got to get yourself a spoon.  Spoons never run away, they never rat you out, they come in handy when all you’ve got is soup, and, best of all, they turn into a weapon during a bar fight.  Sure they’re not much when it comes to talking, but who wants a blabbermouth for a friend anyway?  I’ll take a spoon over a Chatty Carl any day of the week.\n\nSpoons are one thing, but spooning is a whole other story.  I hate spooning.  Unless we’re huddling for warmth, I don’t want to sleep anywhere near someone.  I need my space.  If you get too close to me when I’m sleeping, get ready for some bruises because I’m a wild child at night.  Tossing, turning, choking, gouging – trust me, you’re better off as far away from me as possible. \n\nAnd that’s…  my blog for today!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n\n\nMy favorite flashback of all time is when I see the black lab puppy I had when I was a kid.  Found him when I was walking back from the night shift at my warehouse job.  I must’ve been seven or eight at the time.  Named the pooch Bozo and let him sleep in my sock drawer when I wasn’t home.  My Ma found him one day and threatened to let the little guy loose, but I slipped her a ten spot and she got real quiet.  Bozo didn’t make it very far in the game of life, but I still see him about four, five times a year.  Even though I can’t pet him, I’m glad that he’s still around, if only in my drug-addled mind.\n\n\nDogs make good friends, but if you’re looking for a really dependable pal, you’ve got to get yourself a spoon.  Spoons never run away, they never rat you out, they come in handy when all you’ve got is soup, and, best of all, they turn into a weapon during a bar fight.  Sure they’re not much when it comes to talking, but who wants a blabbermouth for a friend anyway?  I’ll take a spoon over a Chatty Carl any day of the week.\n\n\nSpoons are one thing, but spooning is a whole other story.  I hate spooning.  Unless we’re huddling for warmth, I don’t want to sleep anywhere near someone.  I need my space.  If you get too close to me when I’m sleeping, get ready for some bruises because I’m a wild child at night.  Tossing, turning, choking, gouging – trust me, you’re better off as far away from me as possible. \n\n\nAnd that’s…  my blog for today!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n"
  },
  {
    "date": { "date": "October 11", "time": "04:25 PM" },
    "content": "I house-sat for a friend last weekend.  I guess some people wouldn’t really call it house-sitting – it was more like squat-sitting.  My buddy Gerson found this great abandoned house over in Honesdale and he’s been squatting there for the past month.  It’s one of the best squat-houses I’ve ever seen -- four bedrooms, working plumbing, only a few raccoons.  If you get the electricity turned on, that house becomes a home in an instant and on top of that, you’ve already got pets.\n\nSquatting can go one of two ways: it can be really great or it can be horrible – truly, truly horrible.  I’ve been in both situations.  Sometime in the late seventies (or was it early eighties?), I found my way into an abandoned factory on the eastern shore of Maryland and thought I was going to have the time of my life.  I hadn’t seen a place that cool since the Playboy Club in Chicago and I was going to make it mine.  What I didn’t know was that the factory was abandoned because it was slowly sinking into the Chesapeake Bay.  I had a kegger one night and a hundred and fifty people dropped right into the water.  Nobody got injured, though.  At least I don’t think so.  As soon as I saw the ground start to give, I got the hell out of there.\n\nI house-sat for a friend last weekend.  I guess some people wouldn’t really call it house-sitting – it was more like squat-sitting.  My buddy Gerson found this great abandoned house over in Honesdale and he’s been squatting there for the past month.  It’s one of the best squat-houses I’ve ever seen -- four bedrooms, working plumbing, only a few raccoons.  If you get the electricity turned on, that house becomes a home in an instant and on top of that, you’ve already got pets.\n\n\nSquatting can go one of two ways: it can be really great or it can be horrible – truly, truly horrible.  I’ve been in both situations.  Sometime in the late seventies (or was it early eighties?), I found my way into an abandoned factory on the eastern shore of Maryland and thought I was going to have the time of my life.  I hadn’t seen a place that cool since the Playboy Club in Chicago and I was going to make it mine.  What I didn’t know was that the factory was abandoned because it was slowly sinking into the Chesapeake Bay.  I had a kegger one night and a hundred and fifty people dropped right into the water.  Nobody got injured, though.  At least I don’t think so.  As soon as I saw the ground start to give, I got the hell out of there.\n\n\nMy best squatting experience was about ten years ago.  It was early winter and I needed a place to crash.  I was cruising around on a moped when I found this ranch house in Wilkes-Barre where the snow had piled up all over the driveway, so I knew it was deserted.  I went inside and it was like finding a little slice of heaven, complete with a full wet bar and a somewhat fresh Christmas tree.  Anyway, I was living there for a little while when I found out the house wasn’t abandoned at all.  I suppose that explained all the food in the fridge.  When the family came home after a week, I planned on moving out, I really did, but I had already gotten into a routine and the house was kind of perfect for me, so I decided to stick around and see if I could make it work around their schedule.  As it turned out, the family was out of the house by eight every morning anyway, so I could do as I pleased.\n\nOne day, about a month into my squatting, I accidentally fell asleep in the tub.  Ray, the man of the house, caught me and kicked me out.  I learned an important lesson that day:  if you’re squatting, take a shower.  Nobody falls asleep in the shower.  Taking baths, however, just sets you up for failure.  I cherish that month with the Fullers, though.  It really reminded me what it was like to have a family.  I still visit them sometimes – they don’t know it, but I spent last weekend with them.  Great turkey chili, Mrs. F!  Keep up the good work.\n\n\nMy best squatting experience was about ten years ago.  It was early winter and I needed a place to crash.  I was cruising around on a moped when I found this ranch house in Wilkes-Barre where the snow had piled up all over the driveway, so I knew it was deserted.  I went inside and it was like finding a little slice of heaven, complete with a full wet bar and a somewhat fresh Christmas tree.  Anyway, I was living there for a little while when I found out the house wasn’t abandoned at all.  I suppose that explained all the food in the fridge.  When the family came home after a week, I planned on moving out, I really did, but I had already gotten into a routine and the house was kind of perfect for me, so I decided to stick around and see if I could make it work around their schedule.  As it turned out, the family was out of the house by eight every morning anyway, so I could do as I pleased.\n\n\nOne day, about a month into my squatting, I accidentally fell asleep in the tub.  Ray, the man of the house, caught me and kicked me out.  I learned an important lesson that day:  if you’re squatting, take a shower.  Nobody falls asleep in the shower.  Taking baths, however, just sets you up for failure.  I cherish that month with the Fullers, though.  It really reminded me what it was like to have a family.  I still visit them sometimes – they don’t know it, but I spent last weekend with them.  Great turkey chili, Mrs. F!  Keep up the good work."
  },
  {
    "date": { "date": "October 04", "time": "02:34 PM" },
    "content": "When I get hungry – and I mean hungry – there are only five words that can satisfy me: All-You-Can-Eat Buffet.  They’re like libraries of food, but instead of late fees, they’ve got soft-serve.  I hit up the local buffets at least once a month, sometimes more depending on how business is going.  It really breaks up my normal routine of soup, soup, tuna, soup, microwave pasta, tuna-soup casserole.  \n\nMost people think you’ve got to eat meat to fill up at buffets.  No way, suckers.  It’s all about the sauces.  Think about it: your body is mostly made up of fluid.  Blood, water, guts.  It’s all liquid.  So does it make sense to shove a whole bunch of solids down your gullet?  Think again.  You want to stock up on the sauces because they’ll keep you full the longest.  Go for a big old glass of Alfredo sauce and you won’t eat for weeks.  Chinese buffets are great for this, too.  Kung pao might be spicy, but you drink enough of it and you won’t even be able to think about eating.\n\nWhen I get hungry – and I mean hungry – there are only five words that can satisfy me: All-You-Can-Eat Buffet.  They’re like libraries of food, but instead of late fees, they’ve got soft-serve.  I hit up the local buffets at least once a month, sometimes more depending on how business is going.  It really breaks up my normal routine of soup, soup, tuna, soup, microwave pasta, tuna-soup casserole.  \n\n\nMost people think you’ve got to eat meat to fill up at buffets.  No way, suckers.  It’s all about the sauces.  Think about it: your body is mostly made up of fluid.  Blood, water, guts.  It’s all liquid.  So does it make sense to shove a whole bunch of solids down your gullet?  Think again.  You want to stock up on the sauces because they’ll keep you full the longest.  Go for a big old glass of Alfredo sauce and you won’t eat for weeks.  Chinese buffets are great for this, too.  Kung pao might be spicy, but you drink enough of it and you won’t even be able to think about eating.\n\n\nIt drives me crazy when buffets only offer one type of Jell-O.\n\nRegular restaurants have waitresses that you’re supposed to tip.  Buffets have waitresses that you don’t have to tip because you’re doing all the work yourself.  These broads have tons of time on their hands because you’re the idiot running back and forth with the food.  So here’s what you do: get real friendly with one of them.  I usually pick the biggest one because she’s probably the loneliest.  Start talking to her, get all buddy-buddy and pretty soon, you’ve the inside scoop on when the fried chicken’s coming out fresh.  Basic rule of life: The nicer you are, the nicer they are.  One time in Tulsa, I made nice with a gal named Janice and she packed me up fifteen steaks to go just because I said she had a pretty chin.  Now that’s customer service.\n\nSeriously, the Jell-O thing drives me crazy.  It costs, what, a dollar to make a whole tray?  Loosen up the purse strings and throw some lemon and orange in with that cherry.  Also, stop suspending fruit in there.  If you want to mix something in, try a little meat sauce – it’s be delicious and filling.\n\nI had an idea the other day and if anyone steals it, I’ll hunt them down.  Here’s the idea: buffets should start selling different size plates.  You pay three bucks for the small, five bucks for the medium, and ten bucks for the large.  I’m a real good stacker so I’d just have to pay for the little one and go to town.  Fat people would probably shell out for the tenners so they wouldn’t have to get up so many times.  I’m telling you, this is pure genius.  I’ve been calling around to different buffet companies and one of them is going to make me a rich man, believe me.  Honestly, if you steal this idea I will dismantle you.\n\n\n\nIt drives me crazy when buffets only offer one type of Jell-O.\n\n\nRegular restaurants have waitresses that you’re supposed to tip.  Buffets have waitresses that you don’t have to tip because you’re doing all the work yourself.  These broads have tons of time on their hands because you’re the idiot running back and forth with the food.  So here’s what you do: get real friendly with one of them.  I usually pick the biggest one because she’s probably the loneliest.  Start talking to her, get all buddy-buddy and pretty soon, you’ve the inside scoop on when the fried chicken’s coming out fresh.  Basic rule of life: The nicer you are, the nicer they are.  One time in Tulsa, I made nice with a gal named Janice and she packed me up fifteen steaks to go just because I said she had a pretty chin.  Now that’s customer service.\n\n\nSeriously, the Jell-O thing drives me crazy.  It costs, what, a dollar to make a whole tray?  Loosen up the purse strings and throw some lemon and orange in with that cherry.  Also, stop suspending fruit in there.  If you want to mix something in, try a little meat sauce – it’s be delicious and filling.\n\n\nI had an idea the other day and if anyone steals it, I’ll hunt them down.  Here’s the idea: buffets should start selling different size plates.  You pay three bucks for the small, five bucks for the medium, and ten bucks for the large.  I’m a real good stacker so I’d just have to pay for the little one and go to town.  Fat people would probably shell out for the tenners so they wouldn’t have to get up so many times.  I’m telling you, this is pure genius.  I’ve been calling around to different buffet companies and one of them is going to make me a rich man, believe me.  Honestly, if you steal this idea I will dismantle you.\n"
  },
  {
    "date": { "date": "September 27", "time": "12:37 PM" },
    "content": "Fall is in the air and that means seven things: Political elections, Lyle Lovett’s birthday, the holiday where ghosts make candy, April Fool’s Day, it’s too cold to play tennis, look out for skunks, and most of all, baseball.  \n\nI like winners.  That’s why I only watch baseball for the last month of the season.  Every other month is about losses teams rack up, but September is for winners.  Same goes for handball, but nobody pays attention to handball anymore.  Handball’s become soccer for people that think soccer’s too mainstream.\n\nFall is in the air and that means seven things: Political elections, Lyle Lovett’s birthday, the holiday where ghosts make candy, April Fool’s Day, it’s too cold to play tennis, look out for skunks, and most of all, baseball.  \n\n\nI like winners.  That’s why I only watch baseball for the last month of the season.  Every other month is about losses teams rack up, but September is for winners.  Same goes for handball, but nobody pays attention to handball anymore.  Handball’s become soccer for people that think soccer’s too mainstream.\n\nNever been to Cooperstown, but if I had to pick my own quintet of Hall of Famers, they’d be Stormin’ Gorman Thomas from the Brewers, Tommie Agee from the New York Metropolitans, Oakland Athletic Matty Keough, Boog Powell over in Baltimore, and my father, John Kinsella of the Chicago White Stockings.  I’d put those five guys on the field against any team of nine you’ve got.  They’d whoop ‘em.\n\nWhen I was little, I took the cover off a baseball and made it into a hat for my schnauzer.\n\nI hear the Cubs still haven’t won the World Series.  Let that be a lesson to everyone: That’s what you get for making love to a goat in center field.\n\nWhen will baseball teams learn?  If you want your league to survive, you’ve got to have cheerleaders.  I’m sorry to say this, but I don’t know how long baseball’s going to be around if they don’t get their act together.  Let the ladies cheer!\n\nI went through a stretch a few years back where I wore batting gloves to work because my hands were so slippery.  I was wearing special deodorant at the time because I tend to sweat a lot and it made the sweat come out of my palms instead of my pits.  The batting gloves helped out, but with all the moisture, they ended up smelling like death and who likes to be reminded of that?  I donated them to the Baseball Hall of Fame and took it as a write-off.\n\nI’m giving thirty to one odds on Cincinnati for the Series this year.  Let me know if you’re interested.\n\nHow’s this for a slogan for Major League Baseball: “Baseball: We’re just like the other sports you like, but we play more games and the score’s a lot lower.”  I’m going to make t-shirts.  Who’s buying one?\n\n\nNever been to Cooperstown, but if I had to pick my own quintet of Hall of Famers, they’d be Stormin’ Gorman Thomas from the Brewers, Tommie Agee from the New York Metropolitans, Oakland Athletic Matty Keough, Boog Powell over in Baltimore, and my father, John Kinsella of the Chicago White Stockings.  I’d put those five guys on the field against any team of nine you’ve got.  They’d whoop ‘em.\n\n\nWhen I was little, I took the cover off a baseball and made it into a hat for my schnauzer.\n\n\nI hear the Cubs still haven’t won the World Series.  Let that be a lesson to everyone: That’s what you get for making love to a goat in center field.\n\n\nWhen will baseball teams learn?  If you want your league to survive, you’ve got to have cheerleaders.  I’m sorry to say this, but I don’t know how long baseball’s going to be around if they don’t get their act together.  Let the ladies cheer!\n\n\nI went through a stretch a few years back where I wore batting gloves to work because my hands were so slippery.  I was wearing special deodorant at the time because I tend to sweat a lot and it made the sweat come out of my palms instead of my pits.  The batting gloves helped out, but with all the moisture, they ended up smelling like death and who likes to be reminded of that?  I donated them to the Baseball Hall of Fame and took it as a write-off.\n\n\nI’m giving thirty to one odds on Cincinnati for the Series this year.  Let me know if you’re interested.\n\n\nHow’s this for a slogan for Major League Baseball: “Baseball: We’re just like the other sports you like, but we play more games and the score’s a lot lower.”  I’m going to make t-shirts.  Who’s buying one?\n"
  },
  {
    "date": { "date": "September 20", "time": "03:03 PM" },
    "content": "Sad week for the Creedster.  My girlfriend decided to call it quits on me.  She’s been locked up over in Muncy for the past seven years on a bogus B and E with intent to commit a felony.  I can tell you with absolute certainty that LaDonna didn’t intend anything.  She never does.  Maybe that was the problem.  With only a month left on her sentence, she told me she got cold feet.  Wanted her options open when she got sprung, I guess.  If she played nice, she could’ve gotten out a few years ago, but my little devil has lots of issues with authority.  That’s one of the reasons we made such a good couple.\n\nSad week for the Creedster.  My girlfriend decided to call it quits on me.  She’s been locked up over in Muncy for the past seven years on a bogus B and E with intent to commit a felony.  I can tell you with absolute certainty that LaDonna didn’t intend anything.  She never does.  Maybe that was the problem.  With only a month left on her sentence, she told me she got cold feet.  Wanted her options open when she got sprung, I guess.  If she played nice, she could’ve gotten out a few years ago, but my little devil has lots of issues with authority.  That’s one of the reasons we made such a good couple.\n\n\nMe and LaDonna met in an airport bar back in the mid-Eighties.  After eight rum runners, the bartender decided LaDonna had had enough.  I didn’t agree.  I ordered her another and put it on some pilot’s tab.  That skinny bartender saw her drinking it and tried to kick her out, but I said hell no and threw my glass at the wall.  At the same time, the dumb pilot noticed someone had been piling up drinks on his tab and that got him pretty steamed.  So here I am, with the bartender yelling at me, the pilot yelling at the bartender and LaDonna whispering “mess ‘em up real good” into my ear.  So I did what I had to.  I took out a smoke bomb I smuggled back from China, threw that sucker on the floor and made a break for it with LaDonna.  Now that’s love.\n\nWhen she got locked up, I went a little nutso.  Wrote her name all over my body with a permanent marker.  It didn’t help me feel any better and I got some kind of ink poisoning, but once I got out of the hospital, I felt like I could deal with it better.  She made me promise never to visit her in the clink and I agreed.  Nobody wants to see visitors when they’re in a cage.  We wrote letters, though.  Long, intimate letters where we invented a new kind of kama sutra.  You should see the one she called the dangling moose.  It was sexy as all hell.\n\nI’m going to miss LaDonna a lot, but lucky for me I’ve got the perfect cure for break-ups: half a bottle of Jack, six jalapeno poppers, and an unauthorized biography of Elizabeth Taylor.  It also works for hangovers.\n\n\nMe and LaDonna met in an airport bar back in the mid-Eighties.  After eight rum runners, the bartender decided LaDonna had had enough.  I didn’t agree.  I ordered her another and put it on some pilot’s tab.  That skinny bartender saw her drinking it and tried to kick her out, but I said hell no and threw my glass at the wall.  At the same time, the dumb pilot noticed someone had been piling up drinks on his tab and that got him pretty steamed.  So here I am, with the bartender yelling at me, the pilot yelling at the bartender and LaDonna whispering “mess ‘em up real good” into my ear.  So I did what I had to.  I took out a smoke bomb I smuggled back from China, threw that sucker on the floor and made a break for it with LaDonna.  Now that’s love.\n\n\nWhen she got locked up, I went a little nutso.  Wrote her name all over my body with a permanent marker.  It didn’t help me feel any better and I got some kind of ink poisoning, but once I got out of the hospital, I felt like I could deal with it better.  She made me promise never to visit her in the clink and I agreed.  Nobody wants to see visitors when they’re in a cage.  We wrote letters, though.  Long, intimate letters where we invented a new kind of kama sutra.  You should see the one she called the dangling moose.  It was sexy as all hell.\n\n\nI’m going to miss LaDonna a lot, but lucky for me I’ve got the perfect cure for break-ups: half a bottle of Jack, six jalapeno poppers, and an unauthorized biography of Elizabeth Taylor.  It also works for hangovers."
  },
  {
    "date": { "date": "September 13", "time": "12:52 PM" },
    "content": "This has been some crazy week.  On Saturday, I went over to the mini-mart to pick up a bunch of breakfast burritos and some rolling papers.  Couldn’t believe my eyes when I saw all the stuff they sell there now.  Disposable cameras, fancy lighters, portable phones.  You name it, they had it.  I thought I had jumped into the future or something, which was weird because I usually think I’m back in the past.  As a joke, I asked the skinny dude behind the counter how much he wanted for the portable phone, thinking he’d say two, three hundred bucks.  When he said twenty bucks, I just about dropped a bomb in my skivvies.  I bought one immediately.  Best purchase I ever made in my life because now I don’t have to stand guard outside my phone booth at the bus station waiting for calls.  If someone needs to find me, they can just call my portable and, if I feel like it, I’ll pick up.  Technology, man.  It blows my mind.\n\nThis has been some crazy week.  On Saturday, I went over to the mini-mart to pick up a bunch of breakfast burritos and some rolling papers.  Couldn’t believe my eyes when I saw all the stuff they sell there now.  Disposable cameras, fancy lighters, portable phones.  You name it, they had it.  I thought I had jumped into the future or something, which was weird because I usually think I’m back in the past.  As a joke, I asked the skinny dude behind the counter how much he wanted for the portable phone, thinking he’d say two, three hundred bucks.  When he said twenty bucks, I just about dropped a bomb in my skivvies.  I bought one immediately.  Best purchase I ever made in my life because now I don’t have to stand guard outside my phone booth at the bus station waiting for calls.  If someone needs to find me, they can just call my portable and, if I feel like it, I’ll pick up.  Technology, man.  It blows my mind.\n\nHey – you know that rumor about if you feed antacid to birds, their stomachs blow up?  Is that true?  No reason, just is it true or not?  No biggie if you don’t know, and there’s no particular reason why I’m asking the question, but I would like to know soon, not for any real reason, but I would like to know, so let me know, if you know, so if it’s true I can start making bird bombs.\n\nFootball started back up and I’ve got to say, I’m disappointed.  It just hasn’t been the same since they switched over from the leather helmets.  It’s too easy now. That’s why I’ve always preferred street fighting.  No stupid referees, no lame rules, and you’re guaranteed to see some blood.  That’s my kind of sport.\n\nDon’t try telling me that you’re only as strong as your weakest link.  My weakest link is my ankle and I’ll be damned if I’m going to let it stop me.  I’m as strong as my neck, the strongest part of my body.\n\nMan do I miss the days of fondue.  I don’t know who decided that fondue wasn’t hip anymore, but I want to take that guy behind a dumpster and teach him a lesson with a fondue pot.  If I ever go the chance, I’d take a bath in a giant fondue pot.  No lie.\n\nSpecial Note: To Osama Bin Laden:  Watch out for my bird bombs, sucker.  You better duck every time an eagle flies by.\n\nHey – you know that rumor about if you feed antacid to birds, their stomachs blow up?  Is that true?  No reason, just is it true or not?  No biggie if you don’t know, and there’s no particular reason why I’m asking the question, but I would like to know soon, not for any real reason, but I would like to know, so let me know, if you know, so if it’s true I can start making bird bombs.\n\n\nFootball started back up and I’ve got to say, I’m disappointed.  It just hasn’t been the same since they switched over from the leather helmets.  It’s too easy now. That’s why I’ve always preferred street fighting.  No stupid referees, no lame rules, and you’re guaranteed to see some blood.  That’s my kind of sport.\n\n\nDon’t try telling me that you’re only as strong as your weakest link.  My weakest link is my ankle and I’ll be damned if I’m going to let it stop me.  I’m as strong as my neck, the strongest part of my body.\n\n\nMan do I miss the days of fondue.  I don’t know who decided that fondue wasn’t hip anymore, but I want to take that guy behind a dumpster and teach him a lesson with a fondue pot.  If I ever go the chance, I’d take a bath in a giant fondue pot.  No lie.\n\n\nSpecial Note: To Osama Bin Laden:  Watch out for my bird bombs, sucker.  You better duck every time an eagle flies by."
  },
  {
    "date": { "date": "September 06", "time": "01:18 PM" },
    "content": "What’s better than a good old-fashioned cookout?  Maybe a duffel bag full of unmarked twenties, but besides that, nothing.  I used to run a summer camp over on Martha’s Vineyard for a few years.  Best business I ever had.  Rich idiots would drop off their little ones at this spot I found in a state forest and then they’d pay me to babysit the kids for the day.  We had all kinds of fun activities, like Sprint Races, Instructional Walking, Move These Rocks, Singing, and Full-Contact Red Rover Red Rover.  I didn’t want to waste my profits on something stupid like food for the kids, so I had to find a way to get some grub on the cheap.  That’s when Crafty Creed got to thinking.  Why not make money off of this untapped pool of adorable labor I was sitting on?\n\nWhat’s better than a good old-fashioned cookout?  Maybe a duffel bag full of unmarked twenties, but besides that, nothing.  I used to run a summer camp over on Martha’s Vineyard for a few years.  Best business I ever had.  Rich idiots would drop off their little ones at this spot I found in a state forest and then they’d pay me to babysit the kids for the day.  We had all kinds of fun activities, like Sprint Races, Instructional Walking, Move These Rocks, Singing, and Full-Contact Red Rover Red Rover.  I didn’t want to waste my profits on something stupid like food for the kids, so I had to find a way to get some grub on the cheap.  That’s when Crafty Creed got to thinking.  Why not make money off of this untapped pool of adorable labor I was sitting on?\n\nSo I contracted with a textile dealer and had the kids make “friendship bracelets” all day.  Sold them at tourist traps as authentic Indian crafts and made a bundle.  Ended up trading a case of bracelets for a freezer full of hot dogs and boom – the kids were happy.  And that’s what it’s really all about, isn’t it?  Sadly, I had to shut down the camp when one of my six-year-olds complained to his parents that his fingers hurt from all the bracelet-making. \n\nWent to six barbeques on Labor Day.  They were great,  Made some new friends, ate my weight in encased meats, and drank my way into $300 after challenging some guy named Tiny Franklin to a drinking contest.  First time I’ve ever beaten a midget in anything.  It felt good.\n\nMost people like cookouts for the camaraderie.   Not me.  I go for the free drinks and the relish.  You don’t see relish used a lot anymore, but it’s my favorite condiment by far.  I can eat it for every meal.  In 1981, I ate relish every day for three months.  I tell you what, you get into a bind and all you’ve got is a jar of relish, just heat up that jar and you’ve got yourself some delicious relish soup.  I’m getting hungry just thinking about it.\n\nSo I contracted with a textile dealer and had the kids make “friendship bracelets” all day.  Sold them at tourist traps as authentic Indian crafts and made a bundle.  Ended up trading a case of bracelets for a freezer full of hot dogs and boom – the kids were happy.  And that’s what it’s really all about, isn’t it?  Sadly, I had to shut down the camp when one of my six-year-olds complained to his parents that his fingers hurt from all the bracelet-making. \n\n\nWent to six barbeques on Labor Day.  They were great,  Made some new friends, ate my weight in encased meats, and drank my way into $300 after challenging some guy named Tiny Franklin to a drinking contest.  First time I’ve ever beaten a midget in anything.  It felt good.\n\n\nMost people like cookouts for the camaraderie.   Not me.  I go for the free drinks and the relish.  You don’t see relish used a lot anymore, but it’s my favorite condiment by far.  I can eat it for every meal.  In 1981, I ate relish every day for three months.  I tell you what, you get into a bind and all you’ve got is a jar of relish, just heat up that jar and you’ve got yourself some delicious relish soup.  I’m getting hungry just thinking about it."
  },
  {
    "date": { "date": "August 30", "time": "02:13 PM" },
    "content": "Most people have a thing against bugs, but not me.  I love the little guys.  The way I see it, there’s more of them than there are of us, so you have to respect them just in case.  If they ever got their stuff together, they could really do some serious damage.  I’m talking city destruction, livestock relocation, and political domination here.\n\nIf I had to pick my favorite bug it would have to be a spider.  They’re creepy as all hell but real smart, too.  I lived in a barn once and there was this one spider who I made friends with.  Real classy dame of a spider.  We’d talk about life and love and music.  She was really into Jefferson Airplane.  After our talks, I’d fall asleep and wake up to find little messages written in her web and that’s how I formally learned to read.\n\n\nMost people have a thing against bugs, but not me.  I love the little guys.  The way I see it, there’s more of them than there are of us, so you have to respect them just in case.  If they ever got their stuff together, they could really do some serious damage.  I’m talking city destruction, livestock relocation, and political domination here.\n\n\nIf I had to pick my favorite bug it would have to be a spider.  They’re creepy as all hell but real smart, too.  I lived in a barn once and there was this one spider who I made friends with.  Real classy dame of a spider.  We’d talk about life and love and music.  She was really into Jefferson Airplane.  After our talks, I’d fall asleep and wake up to find little messages written in her web and that’s how I formally learned to read.\n\n\n\nI wonder if land insects ever get jealous of the flying ones.  I bet they do.  If I saw a man flying around while I had to walk around like an idiot, I’d be jealous.  I’d shoot that guy down the first chance I got. \n\nIn the late 70’s I tried to get into Flea Circusing.  It’s not nearly as easy as it sounds.  I bought a group of fleas from my pal Gerry and he told me they all had previous circus experience, but it was a total rip-off.  They couldn’t do any tricks at all.  At least not that I could see.  Maybe they were just camera shy.  Whatever it was, they pretty much just sat there, so I dumped them in the creek behind my hostel.\n\nPeople have to stop saying “that bugs me.”  It’s racist. \n\n\n\nI wonder if land insects ever get jealous of the flying ones.  I bet they do.  If I saw a man flying around while I had to walk around like an idiot, I’d be jealous.  I’d shoot that guy down the first chance I got. \n\n\nIn the late 70’s I tried to get into Flea Circusing.  It’s not nearly as easy as it sounds.  I bought a group of fleas from my pal Gerry and he told me they all had previous circus experience, but it was a total rip-off.  They couldn’t do any tricks at all.  At least not that I could see.  Maybe they were just camera shy.  Whatever it was, they pretty much just sat there, so I dumped them in the creek behind my hostel.\n\n\nPeople have to stop saying “that bugs me.”  It’s racist. \n"
  },
  {
    "date": { "date": "August 23", "time": "05:10 PM" },
    "content": "I’m a big fan of snacks.  Meals are great, too, but who has time to sit down and eat a whole ham these days?  That’s why I get most of my chow from the Vending Machines.  Fills me up and it doesn’t empty my wallet.  I don’t get why it’s just food in there, though.  Why can’t they throw a pair of briefs in the machine for a buck?  Sometimes mine break down and I don’t have next month’s pair with me, so vending machine skivvies would be the perfect replacement.  \n\nHere’s what I know: People buy a lot of stuff from vending machines.  Also, I know a lot of people who are really into misdemeanor crimes.  Makes them feel alive.  So I want to make a special line of vending machine snacks based on people’s favorite crimes.  They’d be delicious, exciting, and fun for kids.\n\nI’m a big fan of snacks.  Meals are great, too, but who has time to sit down and eat a whole ham these days?  That’s why I get most of my chow from the Vending Machines.  Fills me up and it doesn’t empty my wallet.  I don’t get why it’s just food in there, though.  Why can’t they throw a pair of briefs in the machine for a buck?  Sometimes mine break down and I don’t have next month’s pair with me, so vending machine skivvies would be the perfect replacement.  \n\n\nHere’s what I know: People buy a lot of stuff from vending machines.  Also, I know a lot of people who are really into misdemeanor crimes.  Makes them feel alive.  So I want to make a special line of vending machine snacks based on people’s favorite crimes.  They’d be delicious, exciting, and fun for kids.\n\nFirst on the list: Safecracker Crackers.  Perfect for the guy who likes to break into safes, but gets hungry after all that work.  They’d be crackers shaped like little safes with a tiny, spicy combo lock in the middle.  Who wouldn’t buy that?  Or steal it.\n\nNext up: Larceny Bars.  The first thing people think when they steal something is, “Damn, I should have eaten something ahead of time!”  That’s where Larceny Bars come in.  They’re energy bars for thieves.  Keep one of these bad boys in your pocket at all times and the next time you’re picking up a new TV from some rube’s apartment, you’ll have a little pick-me-up waiting for you.  Plus, it keeps you nourished until you find where they stash the diamonds.  I’m going to throw all kinds of stuff in there, too, like chocolate and nuts and caffeine and whiskey and maybe even a little bit of dope.\n\nLet me know if you want to invest in my Crime Snacks business.  I’m taking on cash investors starting right now.  Give me a call or just leave some dough with your name on it by that big rock across the street from Dunder Mifflin. \n\n\nFirst on the list: Safecracker Crackers.  Perfect for the guy who likes to break into safes, but gets hungry after all that work.  They’d be crackers shaped like little safes with a tiny, spicy combo lock in the middle.  Who wouldn’t buy that?  Or steal it.\n\n\nNext up: Larceny Bars.  The first thing people think when they steal something is, “Damn, I should have eaten something ahead of time!”  That’s where Larceny Bars come in.  They’re energy bars for thieves.  Keep one of these bad boys in your pocket at all times and the next time you’re picking up a new TV from some rube’s apartment, you’ll have a little pick-me-up waiting for you.  Plus, it keeps you nourished until you find where they stash the diamonds.  I’m going to throw all kinds of stuff in there, too, like chocolate and nuts and caffeine and whiskey and maybe even a little bit of dope.\n\n\nLet me know if you want to invest in my Crime Snacks business.  I’m taking on cash investors starting right now.  Give me a call or just leave some dough with your name on it by that big rock across the street from Dunder Mifflin. \n"
  },
  {
    "date": { "date": "August 16", "time": "01:17 PM" },
    "content": "I'm a romantic guy.  Always have been.  Fell in love for the first time in the fourth grade with the Truancy Officer.  Ever since then, I’ve had a thing for women with badges.  Cops, security officers, DEA -- doesn’t matter to me.  They’re all foxy.  \n\nLove is tricky.  It makes you do crazy things.  Back in ’73, I got into a love triangle.  Love pyramid, really.  Put $6,000 into a cigarette resale venture and just waited for the dough to start pouring in.  It never did.  Lost my savings for a shot with the DePalma sisters, but it was worth it.  I’ve still got some old smokes sitting in a storage shed up in Delaware.  It’s my little reminder of the price of love.\n\nI'm a romantic guy.  Always have been.  Fell in love for the first time in the fourth grade with the Truancy Officer.  Ever since then, I’ve had a thing for women with badges.  Cops, security officers, DEA -- doesn’t matter to me.  They’re all foxy.  \n\n\nLove is tricky.  It makes you do crazy things.  Back in ’73, I got into a love triangle.  Love pyramid, really.  Put $6,000 into a cigarette resale venture and just waited for the dough to start pouring in.  It never did.  Lost my savings for a shot with the DePalma sisters, but it was worth it.  I’ve still got some old smokes sitting in a storage shed up in Delaware.  It’s my little reminder of the price of love.\n\nIf I ever wanted to get married again, I’d go for height over substance.  Pretty wives are good for taking to buffets, but tall wives get you noticed.  Wealthy’s also a good quality to find in a lady.  I’ve got to find me a rich, tall broad.  That’ll keep me happy.\n\nThere’s one lady who might fit the bill and her name is Louise.  She works as a toll collector at the Wilkes-Barre exit on the Pike.  Lou's a big woman, really fills out her uniform and I like it.   I'm going to show up at her tollbooth next weekend wearing my lucky socks and my sex pants.  Then I'm going to read her a poem I've been working on, in the style of my man Willy Carlos Williams.  After that, I'll spray paint all the windows in her booth black and show her why they call me \"The Guiding Principle.\"  It's going to be smooth.  Don’t know if she’s rich, but she definitely has access to a lot of change and that’s good enough for me. \n\nThere’re only six things you need if you want to snag a good woman:  A guitar, chicken, wine, a car, running water, and some permanent markers.  If you don’t have a guitar, a lute will do.  You get those six things and you’re Don Juan, trust me. \n\nIf I ever wanted to get married again, I’d go for height over substance.  Pretty wives are good for taking to buffets, but tall wives get you noticed.  Wealthy’s also a good quality to find in a lady.  I’ve got to find me a rich, tall broad.  That’ll keep me happy.\n\n\nThere’s one lady who might fit the bill and her name is Louise.  She works as a toll collector at the Wilkes-Barre exit on the Pike.  Lou's a big woman, really fills out her uniform and I like it.   I'm going to show up at her tollbooth next weekend wearing my lucky socks and my sex pants.  Then I'm going to read her a poem I've been working on, in the style of my man Willy Carlos Williams.  After that, I'll spray paint all the windows in her booth black and show her why they call me \"The Guiding Principle.\"  It's going to be smooth.  Don’t know if she’s rich, but she definitely has access to a lot of change and that’s good enough for me. \n\n\nThere’re only six things you need if you want to snag a good woman:  A guitar, chicken, wine, a car, running water, and some permanent markers.  If you don’t have a guitar, a lute will do.  You get those six things and you’re Don Juan, trust me. "
  },
  {
    "date": { "date": "August 09", "time": "11:53 AM" },
    "content": "I have this computer at home.  A friend needed to get rid of it fast and he needed a vacuum, so I traded him.  Anyway, I don’t even use it that much.  Sometimes if I’m going to a coffee shop to look at women, I’ll bring it with me to look busy, but that’s about all.  \n\nThe other day, I overheard some dudes at work – the fatso and the fruit – and they were talking about some internet video of water buffaloes fighting lions.   I don’t know about you, but that’s the kind of thing I can build a whole night around.  I stopped at the supermarket on the way home and picked up some things to get me in the mood:  Buffalo jerky, buffalo wings, Frosted Flakes, some cupcakes, and a bottle of white wine.  (Side note: I couldn’t find any lion-related items at the store, so I settled for the Flakes because of the Tiger.  It was the best I could do.)  When I got home, I was really jazzed for a good old-fashioned jungle fight.  I turned on my computer and boom – nothing happened.  Just a weird clucking noise and a black screen, so I did what anybody would do.  I punched my computer and then I called tech support.\n\nI have this computer at home.  A friend needed to get rid of it fast and he needed a vacuum, so I traded him.  Anyway, I don’t even use it that much.  Sometimes if I’m going to a coffee shop to look at women, I’ll bring it with me to look busy, but that’s about all.  \n\n\nThe other day, I overheard some dudes at work – the fatso and the fruit – and they were talking about some internet video of water buffaloes fighting lions.   I don’t know about you, but that’s the kind of thing I can build a whole night around.  I stopped at the supermarket on the way home and picked up some things to get me in the mood:  Buffalo jerky, buffalo wings, Frosted Flakes, some cupcakes, and a bottle of white wine.  (Side note: I couldn’t find any lion-related items at the store, so I settled for the Flakes because of the Tiger.  It was the best I could do.)  When I got home, I was really jazzed for a good old-fashioned jungle fight.  I turned on my computer and boom – nothing happened.  Just a weird clucking noise and a black screen, so I did what anybody would do.  I punched my computer and then I called tech support.\n\nThis Indian dude takes my name, my phone number, and my email address.  I gave him some fakes.  I have enough problems in India without the cops finding out where I live.  Then he wants me to tell him the problem with the computer.  “The damn thing don’t work!” I say.  He says “Okay, Sir, it would be my pleasure to assist you with that today.”  I’m thinking, it would be my pleasure to stick your ass on top of the Taj Mahal, but I don’t say it because I’m smart.  You catch more flies with really friendly decoy flies, that’s what I always say.  \n\nSo I let this guy tell me what he thinks is wrong and then he asks for the serial number.  I give that to him, too, and then he tells me I don’t have a warranty anymore.  I’ve been on the phone for ten minutes already and now he tells me he can’t help me because of some stupid warranty.  I’m ready to kill this guy, but I play nice and then the guy tells me he can help, but it’s going to cost me fifty bucks.  Fifty bucks?  If I’m paying you fifty bucks to fix a computer, (a) you’re going to do it naked and (b) you’re going to cook me dinner.  Well, you can’t do either if you’re halfway around the globe so I hung up on that idiot.  \n\nLong story short, I got rid of the laptop right away.  Did what I always do with broken gizmos:  Threw it into the dumpster and filed a police report saying somebody stole it.  Next time somebody turns in a lost laptop to the fuzz, I’m going to have myself a new computer.  It just goes to show you:  you can screw with Old Creed all you want, but in the end he’s always going to win. \n\np.s.  If I ever find you, “Franklin,” I’m going to take you out Tamil Tiger style and I never forget a voice, even when you’re talking in a fake American accent.\n\nThis Indian dude takes my name, my phone number, and my email address.  I gave him some fakes.  I have enough problems in India without the cops finding out where I live.  Then he wants me to tell him the problem with the computer.  “The damn thing don’t work!” I say.  He says “Okay, Sir, it would be my pleasure to assist you with that today.”  I’m thinking, it would be my pleasure to stick your ass on top of the Taj Mahal, but I don’t say it because I’m smart.  You catch more flies with really friendly decoy flies, that’s what I always say.  \n\n\nSo I let this guy tell me what he thinks is wrong and then he asks for the serial number.  I give that to him, too, and then he tells me I don’t have a warranty anymore.  I’ve been on the phone for ten minutes already and now he tells me he can’t help me because of some stupid warranty.  I’m ready to kill this guy, but I play nice and then the guy tells me he can help, but it’s going to cost me fifty bucks.  Fifty bucks?  If I’m paying you fifty bucks to fix a computer, (a) you’re going to do it naked and (b) you’re going to cook me dinner.  Well, you can’t do either if you’re halfway around the globe so I hung up on that idiot.  \n\n\nLong story short, I got rid of the laptop right away.  Did what I always do with broken gizmos:  Threw it into the dumpster and filed a police report saying somebody stole it.  Next time somebody turns in a lost laptop to the fuzz, I’m going to have myself a new computer.  It just goes to show you:  you can screw with Old Creed all you want, but in the end he’s always going to win. \n\n\np.s.  If I ever find you, “Franklin,” I’m going to take you out Tamil Tiger style and I never forget a voice, even when you’re talking in a fake American accent."
  },
  {
    "date": { "date": "August 02", "time": "01:16 PM" },
    "content": "Fall is just around the corner and you know what that means: Crab Apple Season.  I’m getting hungry just thinking about them.  These little buggers pop up all over the place and nobody wants them because people are idiots.  As a result, they’re absolutely free, which is my favorite price of all.  \n\nCrab apples have a whole stinkload of benefits.  Back when I was little, my grandpa used to stick a crab apple in my mouth every time I stuttered.  And guess what?  I don’t stutter anymore.  Crap apples are tiny miracles.  \n\nFall is just around the corner and you know what that means: Crab Apple Season.  I’m getting hungry just thinking about them.  These little buggers pop up all over the place and nobody wants them because people are idiots.  As a result, they’re absolutely free, which is my favorite price of all.  \n\n\nCrab apples have a whole stinkload of benefits.  Back when I was little, my grandpa used to stick a crab apple in my mouth every time I stuttered.  And guess what?  I don’t stutter anymore.  Crap apples are tiny miracles.  \n\nAnyway, farmers usually get mad when I help myself to their apples but when I’m picking up crab apples, I’m a real American hero to them.  Also, crab apples are an instant cure for cancer.  Plus, crab apples are useful in all situations.  You can use them in jelly or applesauce or one time I cut myself real bad trying to get over some razor wire.  Took out a crab apple, sliced it in half, rubbed it on my wounds and a few minutes later I was better than new.  Ended up getting a pretty nice TV out of that night, too. \n\nI can’t think of anything else in my life that I look forward to more than Crab Apple Season.  Maybe 4th of July, but that’s just because I know when everyone’s going to be out of their houses watching fireworks.  If you’re looking for a free nutritious food that’s available without dealing with the jerks at the grocery store, you really can’t beat crab apples.  Stay away from Scranton, though, because those crabbies belong to me.\n\nSide Note:  Crab apples have nothing to do with real crabs.  I don’t want to get into some kind of lawsuit because you made an idiotic assumption, so I’m setting the record straight right now.  Crab apples contain no actual crabmeat.  There you go.\n\nAnyway, farmers usually get mad when I help myself to their apples but when I’m picking up crab apples, I’m a real American hero to them.  Also, crab apples are an instant cure for cancer.  Plus, crab apples are useful in all situations.  You can use them in jelly or applesauce or one time I cut myself real bad trying to get over some razor wire.  Took out a crab apple, sliced it in half, rubbed it on my wounds and a few minutes later I was better than new.  Ended up getting a pretty nice TV out of that night, too. \n\n\nI can’t think of anything else in my life that I look forward to more than Crab Apple Season.  Maybe 4th of July, but that’s just because I know when everyone’s going to be out of their houses watching fireworks.  If you’re looking for a free nutritious food that’s available without dealing with the jerks at the grocery store, you really can’t beat crab apples.  Stay away from Scranton, though, because those crabbies belong to me.\n\n\nSide Note:  Crab apples have nothing to do with real crabs.  I don’t want to get into some kind of lawsuit because you made an idiotic assumption, so I’m setting the record straight right now.  Crab apples contain no actual crabmeat.  There you go."
  },
  {
    "date": { "date": "July 26", "time": "02:11 PM" },
    "content": "So I’ve been thinking about running for Governor.  There’re a lot of things wrong with Pennsylvania and since nobody’s answering my letters over at the Governor’s Office in Philadelphia, I think it’s time to take matters into my own hands.  I know what you’re thinking and yes, they are wrinkled, but they’re still strong.\n\nNumber One on my list of changes:  Pennsylvania should change its name to Transylvania.  Lots of idiots buy all kinds of vampire rings and vampire necklaces and garlic-flavored vampire gum.  There’s a lot of dough to be made from these suckers and I’m tired of seeing it go to foreigners.  If we change the name of the state, we can probably do away with property tax considering the amount of souvenirs we’re going to sell.  Also, vampire fans are notoriously good tippers.\n\nSo I’ve been thinking about running for Governor.  There’re a lot of things wrong with Pennsylvania and since nobody’s answering my letters over at the Governor’s Office in Philadelphia, I think it’s time to take matters into my own hands.  I know what you’re thinking and yes, they are wrinkled, but they’re still strong.\n\n\nNumber One on my list of changes:  Pennsylvania should change its name to Transylvania.  Lots of idiots buy all kinds of vampire rings and vampire necklaces and garlic-flavored vampire gum.  There’s a lot of dough to be made from these suckers and I’m tired of seeing it go to foreigners.  If we change the name of the state, we can probably do away with property tax considering the amount of souvenirs we’re going to sell.  Also, vampire fans are notoriously good tippers.\n\nNumber Two:  Cops’ uniforms should be neon yellow.  The get-ups they wear now make it too hard to see them coming at night and I’m tired of those jerks sneaking up on me.  If I’m elected Governor, I want to make sure that people know where cops are at all times.\n\nNumber Three:  Soup kitchens have to offer more variety.  From what I’ve heard, they serve the same soup two, three times a week.  People really get sick of mushroom barley all the time, you know?\n\nNumber Three and a Half: Mushroom Barley soup will be illegal across the state.  Honestly, I don’t think anyone’s going to miss it.  \n\nNumber Four: Increase funding to all public schools.\n\nNumber Five:  I will institute a database with pictures of every resident in the state naked.  Every five years, a citizen can request to view any one person’s naked picture for a viewing period of ten minutes.  After they’ve used up their viewing, they have to wait another five years until they can view another.  It’s just not fair for all these foxy ladies to be walking around without anyone being able to see them naked.  This is going to be the cornerstone of my campaign.   \n\nI’ve got a lot more ideas for making this state the best in the country and if you vote for me, I promise to listen to everything you have to say.  Now, I know I haven’t voted for the past fifty years, but I think that’s going to give me a real leg up on the competition because they can’t attack me for my voting record.  Stick with me and we’ll make some real changes to this stupid square state.  \n\nVote Creed for Governor: “The Guy Who’s Going to Make You Rich Off of People Who Believe in Vampires!”\n\n\nNumber Two:  Cops’ uniforms should be neon yellow.  The get-ups they wear now make it too hard to see them coming at night and I’m tired of those jerks sneaking up on me.  If I’m elected Governor, I want to make sure that people know where cops are at all times.\n\n\nNumber Three:  Soup kitchens have to offer more variety.  From what I’ve heard, they serve the same soup two, three times a week.  People really get sick of mushroom barley all the time, you know?\n\n\nNumber Three and a Half: Mushroom Barley soup will be illegal across the state.  Honestly, I don’t think anyone’s going to miss it.  \n\n\nNumber Four: Increase funding to all public schools.\n\n\nNumber Five:  I will institute a database with pictures of every resident in the state naked.  Every five years, a citizen can request to view any one person’s naked picture for a viewing period of ten minutes.  After they’ve used up their viewing, they have to wait another five years until they can view another.  It’s just not fair for all these foxy ladies to be walking around without anyone being able to see them naked.  This is going to be the cornerstone of my campaign.   \n\n\nI’ve got a lot more ideas for making this state the best in the country and if you vote for me, I promise to listen to everything you have to say.  Now, I know I haven’t voted for the past fifty years, but I think that’s going to give me a real leg up on the competition because they can’t attack me for my voting record.  Stick with me and we’ll make some real changes to this stupid square state.  \n\n\nVote Creed for Governor: “The Guy Who’s Going to Make You Rich Off of People Who Believe in Vampires!”\n"
  },
  {
    "date": { "date": "July 19", "time": "08:33 PM" },
    "content": "In my younger days, I spent a lot of time sleeping in a lot of places.  Some of those places were bus stations.  Everyone knows that hotels are for suckers, so why pay for lodging when you can get it for free?  The problem is, there are a lot of crazies out there, so if you’re going to sleep in the bus station you’ve got to be savvy about it. \n\nFirst of all, make friends with the night watchman.  That’s the guy that can have the fuzz come and take you away.  Find out what kind of candy he likes and bring him some.  I can’t tell you how many times I’ve stayed in a station worry-free because of a few Bit O’Honeys.\n\n\nIn my younger days, I spent a lot of time sleeping in a lot of places.  Some of those places were bus stations.  Everyone knows that hotels are for suckers, so why pay for lodging when you can get it for free?  The problem is, there are a lot of crazies out there, so if you’re going to sleep in the bus station you’ve got to be savvy about it. \n\n\nFirst of all, make friends with the night watchman.  That’s the guy that can have the fuzz come and take you away.  Find out what kind of candy he likes and bring him some.  I can’t tell you how many times I’ve stayed in a station worry-free because of a few Bit O’Honeys.\n\n\nPick up an old bus ticket.  That way, if somebody gives you trouble, you just say you’re waiting for a bus and show them the ticket.  No one ever really bothers to look, so you should be golden.  If they do look, run like hell.\n\nSome idiot security guard comes by and asks why you’re sleeping on the benches?  You’re from the bench company and you’re testing comfort levels.  Be creative.  Whatever you do, don’t say you’re the bus driver.  I made that mistake once in the 60’s and I ended up driving a busload of people to Jacksonville. \n\nIt was a weeklong trip and it was hot as hell.  By the third day, some of the passengers started cooking bacon on the floor.  I couldn’t complain, though, because I was driving the best smelling bus on the East Coast.  \n\nThere was a young man sitting in the back of the bus who claimed to be a magician.  Said his name was “The Great Alamundo.” He went up and down the aisles doing card tricks for people to pass the time.  His deck of cards only had diamonds and clubs, though.  He told me he sold the spades and hearts a while back for a few packs of cigarettes.  Now that’s a smart magician. When we stopped in Macon, GA, I bought a new deck of cards for the guy, but he wouldn’t accept it.  Didn’t want to be a charity case, I guess.  His loss.  \n\nOnce the card tricks lost their fun, the passengers started to get rowdy.  I knew I had to keep them occupied or they were going to revolt.  Long story short, I got everyone singing Johnny Mathis songs and the mood changed in a hurry.  By the time we got to Jacksonville, I could hardly pry those people out of their seats.  I ended up selling the bus for $400 and living in Florida for eight months.  All in all, it was a pretty good trip.\n\nPick up an old bus ticket.  That way, if somebody gives you trouble, you just say you’re waiting for a bus and show them the ticket.  No one ever really bothers to look, so you should be golden.  If they do look, run like hell.\n\n\nSome idiot security guard comes by and asks why you’re sleeping on the benches?  You’re from the bench company and you’re testing comfort levels.  Be creative.  Whatever you do, don’t say you’re the bus driver.  I made that mistake once in the 60’s and I ended up driving a busload of people to Jacksonville. \n\n\nIt was a weeklong trip and it was hot as hell.  By the third day, some of the passengers started cooking bacon on the floor.  I couldn’t complain, though, because I was driving the best smelling bus on the East Coast.  \n\n\n\nThere was a young man sitting in the back of the bus who claimed to be a magician.  Said his name was “The Great Alamundo.” He went up and down the aisles doing card tricks for people to pass the time.  His deck of cards only had diamonds and clubs, though.  He told me he sold the spades and hearts a while back for a few packs of cigarettes.  Now that’s a smart magician. When we stopped in Macon, GA, I bought a new deck of cards for the guy, but he wouldn’t accept it.  Didn’t want to be a charity case, I guess.  His loss.  \n\n\nOnce the card tricks lost their fun, the passengers started to get rowdy.  I knew I had to keep them occupied or they were going to revolt.  Long story short, I got everyone singing Johnny Mathis songs and the mood changed in a hurry.  By the time we got to Jacksonville, I could hardly pry those people out of their seats.  I ended up selling the bus for $400 and living in Florida for eight months.  All in all, it was a pretty good trip."
  },
  {
    "date": { "date": "July 12", "time": "01:12 PM" },
    "content": "Visors are hats for people that like getting ripped off.\n\nHere’s the thing about handcuffs: there’s only one key for all of them.  It’s not like the Tampa cops have their own special key and the Saskatchewan Mounties have a different one.  They’re all the same.  So the one true goal in any criminal’s life is to get a copy of the handcuff key.  I’ve got thirty.  If you want to buy one, you know where to find me.\n\nVisors are hats for people that like getting ripped off.\n\n\nHere’s the thing about handcuffs: there’s only one key for all of them.  It’s not like the Tampa cops have their own special key and the Saskatchewan Mounties have a different one.  They’re all the same.  So the one true goal in any criminal’s life is to get a copy of the handcuff key.  I’ve got thirty.  If you want to buy one, you know where to find me.\n\nWhat ever happened to free love, man?  Now I’m paying ten, fifteen dollars for it.\n\nMy favorite part of the newspaper is the fun little stories about the dead people and their relatives.\n\nDo you remember where I parked my van?\n\nA pinky’s always a pinky, but a pointer and a ring finger are pretty interchangeable if you need them to be.\n\nThere’s nothing better than a wishing fountain.  Go ahead, idiots, keep throwing your cash away.  Old Creed will make those wishes come true.\n\nI’ve got an idea.\n\nAbout thirty years ago, I fell in love with a blond woman.  She wore vests and skirts and had flowers in her hair.  I think her name was Nancy.  If you’re out there, Nancy, I’m not mad at you anymore.  You can keep the hundred bucks you stole.  I just want you back.  And my birth certificate.\n\nBooks are great when you can’t find a pillow.\n\nReminder: Michael's safe combo: 2-33-26\n\nWhat ever happened to free love, man?  Now I’m paying ten, fifteen dollars for it.\n\n\nMy favorite part of the newspaper is the fun little stories about the dead people and their relatives.\n\n\nDo you remember where I parked my van?\n\n\nA pinky’s always a pinky, but a pointer and a ring finger are pretty interchangeable if you need them to be.\n\n\nThere’s nothing better than a wishing fountain.  Go ahead, idiots, keep throwing your cash away.  Old Creed will make those wishes come true.\n\n\nI’ve got an idea.\n\n\nAbout thirty years ago, I fell in love with a blond woman.  She wore vests and skirts and had flowers in her hair.  I think her name was Nancy.  If you’re out there, Nancy, I’m not mad at you anymore.  You can keep the hundred bucks you stole.  I just want you back.  And my birth certificate.\n\n\nBooks are great when you can’t find a pillow.\n\n\nReminder: Michael's safe combo: 2-33-26"
  },
  {
    "date": { "date": "July 05", "time": "01:58 PM" },
    "content": "Toes are a luxury, not a right.\n\n\nI fought in the Korean War.  For both sides.\n\n\nIf you ask me, the quick money’s in billiards.\n\n\nI love the smell of gasoline right after you light it on fire.\n\n\nRestaurants were created to take advantage of the lazy.  If you’ve got a forest and a lighter, you’ve got dinner.\n\n\nI like my women LOUD.\n\n\nReminder: Michael’s safe combo: 3-22-26\n"
  },
  {
    "date": { "date": "June 28", "time": "01:04 PM" },
    "content": "Who decided that pigs are for eating but rats get a free ride?\n\n\nI’d play the lottery if they let me pick the balls.\n\n\nTelevision hasn’t been good since “The Goldbergs.”\n\n\nI’ve played Monopoly in real life and bankruptcy is a lot harder to get out of than the game makes it seem.\n\n\nMusic really makes me want to sing, man.\n\n\nThey should rename the Virgin Islands.  That was an expensive mistake.\n\n\nReminder: Michael’s safe combo: 36-22-62\n"
  },
  {
    "date": { "date": "June 21", "time": "01:39 PM" },
    "content": "I turn all kinds of things into pies.\n\n\nWho hasn’t lived in a cave at one point or another?  That’s what they’re for.\n\n\nYou say diabetes, I say diabetos.\n\n\nGive me a mug and some beans and I’ll find a way to make your damn coffee.\n\n\nEvery time I step on a nail, I thank my shoes for doing their job the best they could.\n\n\nI’d grow a beard but I don’t have the time.\n\n\nReminder: Michael’s safe combo: 33-26-30\n"
  },
  {
    "date": { "date": "June 14", "time": "01:43 PM" },
    "content": "Winning is everything when it comes to Russian Roulette.\n\n\nI tore my rotator cuff.  I always hated that thing.\n\n\nScrew parasailing, man.  Make the handicapped sail like the rest of us.\n\n\nI’m really bad at remembering birthdays.  I think mine’s in June, but who knows?\n\n\nI’ll take the moon over the sun any day of the week.\n\n\nMan, what ever happened to Zaire?  That place was crazy!\n\n\nReminder: Michael’s safe combo: 23-26-30"
  },
  {
    "date": { "date": "June 07", "time": "07:39 PM" },
    "content": "Boxers or thiefs?  Who wants to know?\n\n\nThis might not be “Peacie,” but I think we should segregate the ghost population from the living.  Thoughts?\n\n\nI’d chew ice cubes all day if they weren’t so sharp.\n\n\nIf you want to be a good hitchhiker, you’ve got to think outside of the thumb.  Don’t just stand there when you could be dancing.\n\n\nTypes of girls I like: Brazilian, Ukrainian, South African, Canadian [the further North, the better], short, Wisconsin.\n\n\nYou’d be surprised to know how many passports I’ve got.\n\n\nReminder: Michael’s safe combo: 23-20-26\n"
  },
  {
    "date": { "date": "May 31", "time": "06:06 PM" },
    "content": "Where’s Thousand Island?  I’ve got some vacation time saved up and it sounds like a delicious place to visit.\n\n\nRoot beer floats.  It does.  I’ve tested it.\n\n\nThere’s a fat man that sits by me.  He has some sort of jar of multi-colored power beans.  I need those beans, man.\n\n\nThe last thing I want to deal with at work is people.\n\n\nI’m thinking about buying a horse.  Great for transportation and once you’re done with it, you’ve got about seven days worth of meals.\n\n\nNever trust mailmen.\n\n\nReminder: Michael’s safe combo: 20-22-36."
  },
  {
    "date": { "date": "May 24", "time": "10:45 PM" },
    "content": "The worst part about Raisin Bran is the bran.  Hands down.\n\n\nI saw a man fishing bottles out of a garbage can yesterday and it reminded me of a funny story.\n\n\nI don’t like hockey.  They should get rid of the pucks and put those shoe blades on their sticks – then you’d have a game on your hands.\n\n\nTo be a good pick pocket, you’ve got to look like a regular Joe.  Don’t dress up in fancy colors or jewelry.  That’s where the Gypsies have it wrong.  Pair of slacks, t-shirt, hat – that’s all you need.  And it helps to have tiny hands, too. \n\n\nI’ve had enough of this LBJ character.\n\n\nIf I had to pick between a chimp and a spider, I’d take the chimp.  Harder to forget where you left it.\n\n\nReminder: Michael’s safe combo: 26-22-30.\n"
  },
  {
    "date": { "date": "May 17", "time": "06:20 PM" },
    "content": "Hey-o, everyone out there in SyberWorld.  It’s old Creed Bratton coming at your again, here from my perch as a Quality Assurance Manager at Dunder Mifflin paper.  Just a few observations on the world around me.\n\n\nWhat do you guys think is the best kind of car?  To me, you can’t beat motorcycles.  They’re small, and dangerous.\n\n\nI got into a car accident yesterday and I just took off.  It didn’t look too bad.  The guy was making a big deal out of it, but come on – dogs don’t live forever.\n\n\nSometimes when I’m sick, or feeling blue, I drink vinegar.  I like all kinds: balsamic, vodka, orange juice, leaves.\n\n\nWorking in an office is fine, but I’d rather be a millionaire.  [Elaborate on this.  It’s interesting.  Maybe Trademark it, too.]\n\n\nToday in my office where I work as Director of Quality Assurance, we went to the beach for some reason that was never adequately explained.  When we were there, our manager told us to eat hot coals.  I thought that was a little bit untoward so I ate a fish.  Then a woman I have literally never seen before in my entire life started talking very loudly about something involving Halpert.  She was agitated, I’d say.  From what I could guess, she was definitely on drugs of some kind, perhaps cocaine, or maybe ‘drines.  Also, she is a knock-out.  She reminds me of a young Daphne Du Maurier.  Also, I stupidly ate the fishbones.  I told myself “never again” after the last time, but then you turn around, and bam, they’re in my mouth.  I also ate 55 hot dogs in 15 minutes, which is a world record.\n\n\nEverybody remembers: “April showers bring May flowers.”  But no one remembers how the rest of that goes.  Which I find so frustrating.\n\n\nPrediction: the Orioles will win the World Series over the Pirates in seven games.\n\nPrediction: the space program will be renamed the Outer Space Program by 2060.\n\nPrediction: someday we will be able to travel faster than sound.  We will “break the sound barrier.”\n\nPrediction: [note – need more predictions.]\n\n\nReminder: Michael’s safe combo: 26-32-20.\n"
  }
]
